
Gladius2DB = {
	["profileKeys"] = {
		["Agonoíze - Stormscale"] = "Agonoíze - Stormscale",
		["Аганойз - Ревущий фьорд"] = "Аганойз - Ревущий фьорд",
		["Аганойзи - Ревущий фьорд"] = "Аганойзи - Ревущий фьорд",
		["Нойзминау - Ревущий фьорд"] = "Нойзминау - Ревущий фьорд",
		["Аксерк - Ревущий фьорд"] = "Аксерк - Ревущий фьорд",
		["Зелюкс - Ревущий фьорд"] = "Зелюкс - Ревущий фьорд",
	},
	["profiles"] = {
		["Agonoíze - Stormscale"] = {
			["auraVersion"] = 1,
			["tagsVersion"] = 4,
			["y"] = {
				["arena1"] = 440.0112234845074,
			},
			["x"] = {
				["arena1"] = 1051.647593261732,
			},
		},
		["Аганойз - Ревущий фьорд"] = {
			["auraVersion"] = 1,
			["tagsVersion"] = 4,
			["x"] = {
				["arena1"] = 1060.177890800405,
			},
			["y"] = {
				["arena1"] = 487.6556187095775,
			},
		},
		["Аганойзи - Ревущий фьорд"] = {
			["auraVersion"] = 1,
			["tagsVersion"] = 4,
			["y"] = {
				["arena1"] = 491.2110995361945,
			},
			["x"] = {
				["arena1"] = 1060.888590237228,
			},
		},
		["Нойзминау - Ревущий фьорд"] = {
			["auraVersion"] = 1,
			["tagsVersion"] = 4,
			["y"] = {
				["arena1"] = 423.655575280718,
			},
			["x"] = {
				["arena1"] = 1058.755460432658,
			},
		},
		["Аксерк - Ревущий фьорд"] = {
			["auraVersion"] = 1,
			["tagsVersion"] = 4,
			["x"] = {
				["arena1"] = 1097.867098402348,
			},
			["y"] = {
				["arena1"] = 511.1222682394509,
			},
		},
		["Зелюкс - Ревущий фьорд"] = {
			["auraVersion"] = 1,
			["tagsVersion"] = 4,
			["x"] = {
				["arena1"] = 968.4445811768819,
			},
			["y"] = {
				["arena1"] = 516.0999017238646,
			},
		},
	},
}
