
HandyNotesDB = {
	["profileKeys"] = {
		["Agonoíze - Stormscale"] = "Agonoíze - Stormscale",
		["Аганойз - Ревущий фьорд"] = "Аганойз - Ревущий фьорд",
		["Аганойзи - Ревущий фьорд"] = "Аганойзи - Ревущий фьорд",
		["Нойзминау - Ревущий фьорд"] = "Нойзминау - Ревущий фьорд",
		["Аксерк - Ревущий фьорд"] = "Аксерк - Ревущий фьорд",
		["Зелюкс - Ревущий фьорд"] = "Зелюкс - Ревущий фьорд",
	},
	["profiles"] = {
		["Agonoíze - Stormscale"] = {
		},
		["Аганойз - Ревущий фьорд"] = {
		},
		["Аганойзи - Ревущий фьорд"] = {
		},
		["Нойзминау - Ревущий фьорд"] = {
		},
		["Аксерк - Ревущий фьорд"] = {
		},
		["Зелюкс - Ревущий фьорд"] = {
		},
	},
}
HandyNotes_HandyNotesDB = {
	["profileKeys"] = {
		["Agonoíze - Stormscale"] = "Agonoíze - Stormscale",
		["Аганойз - Ревущий фьорд"] = "Аганойз - Ревущий фьорд",
		["Аганойзи - Ревущий фьорд"] = "Аганойзи - Ревущий фьорд",
		["Нойзминау - Ревущий фьорд"] = "Нойзминау - Ревущий фьорд",
		["Аксерк - Ревущий фьорд"] = "Аксерк - Ревущий фьорд",
		["Зелюкс - Ревущий фьорд"] = "Зелюкс - Ревущий фьорд",
	},
	["profiles"] = {
		["Agonoíze - Stormscale"] = {
		},
		["Аганойз - Ревущий фьорд"] = {
		},
		["Аганойзи - Ревущий фьорд"] = {
		},
		["Нойзминау - Ревущий фьорд"] = {
		},
		["Аксерк - Ревущий фьорд"] = {
		},
		["Зелюкс - Ревущий фьорд"] = {
		},
	},
}
