
MethodDungeonToolsDB = {
	["profileKeys"] = {
		["Agonoíze - Stormscale"] = "Agonoíze - Stormscale",
		["Аганойз - Ревущий фьорд"] = "Аганойз - Ревущий фьорд",
		["Аганойзи - Ревущий фьорд"] = "Аганойзи - Ревущий фьорд",
		["Нойзминау - Ревущий фьорд"] = "Нойзминау - Ревущий фьорд",
		["Аксерк - Ревущий фьорд"] = "Аксерк - Ревущий фьорд",
		["Зелюкс - Ревущий фьорд"] = "Зелюкс - Ревущий фьорд",
	},
	["global"] = {
		["colorPaletteInfo"] = {
			["customPaletteValues"] = {
				{
					1, -- [1]
					1, -- [2]
					1, -- [3]
				}, -- [1]
				{
					1, -- [1]
					1, -- [2]
					1, -- [3]
				}, -- [2]
				{
					1, -- [1]
					1, -- [2]
					1, -- [3]
				}, -- [3]
				{
					1, -- [1]
					1, -- [2]
					1, -- [3]
				}, -- [4]
				{
					1, -- [1]
					1, -- [2]
					1, -- [3]
				}, -- [5]
				{
					1, -- [1]
					1, -- [2]
					1, -- [3]
				}, -- [6]
				{
					1, -- [1]
					1, -- [2]
					1, -- [3]
				}, -- [7]
				{
					1, -- [1]
					1, -- [2]
					1, -- [3]
				}, -- [8]
				{
					1, -- [1]
					1, -- [2]
					1, -- [3]
				}, -- [9]
				{
					1, -- [1]
					1, -- [2]
					1, -- [3]
				}, -- [10]
				{
					1, -- [1]
					1, -- [2]
					1, -- [3]
				}, -- [11]
				{
					1, -- [1]
					1, -- [2]
					1, -- [3]
				}, -- [12]
			},
		},
		["minimap"] = {
			["minimapPos"] = 133.999140055735,
		},
		["MDI"] = {
		},
		["maximized"] = false,
		["presets"] = {
			[15] = {
				{
					["objects"] = {
					},
					["week"] = 9,
					["mdi"] = {
						["freeholdJoined"] = false,
						["beguiling"] = 1,
						["freehold"] = 1,
					},
					["difficulty"] = 10,
					["value"] = {
						["currentPull"] = 1,
						["currentSublevel"] = 1,
						["selection"] = {
							1, -- [1]
						},
						["currentDungeonIdx"] = 15,
						["teeming"] = false,
						["riftOffsets"] = {
							[9] = {
							},
						},
						["pulls"] = {
							{
								["color"] = "ff3eff",
							}, -- [1]
						},
					},
				}, -- [1]
			},
		},
		["nonFullscreenScale"] = 1,
		["version"] = 304,
	},
}
