
TomTomDB = {
	["profileKeys"] = {
		["Agonoíze - Stormscale"] = "Default",
		["Аганойз - Ревущий фьорд"] = "Default",
		["Аганойзи - Ревущий фьорд"] = "Default",
		["Нойзминау - Ревущий фьорд"] = "Default",
		["Аксерк - Ревущий фьорд"] = "Default",
		["Зелюкс - Ревущий фьорд"] = "Default",
	},
	["profiles"] = {
		["Default"] = {
			["arrow"] = {
				["position"] = {
					"CENTER", -- [1]
					nil, -- [2]
					"CENTER", -- [3]
					0, -- [4]
					0, -- [5]
				},
			},
			["block"] = {
				["position"] = {
					"TOPRIGHT", -- [1]
					nil, -- [2]
					"TOPRIGHT", -- [3]
					-17.82818794250488, -- [4]
					-170.3331604003906, -- [5]
				},
			},
		},
	},
}
TomTomWaypoints = nil
TomTomWaypointsM = {
	["profileKeys"] = {
		["Agonoíze - Stormscale"] = "Agonoíze - Stormscale",
		["Аганойз - Ревущий фьорд"] = "Аганойз - Ревущий фьорд",
		["Аганойзи - Ревущий фьорд"] = "Аганойзи - Ревущий фьорд",
		["Нойзминау - Ревущий фьорд"] = "Нойзминау - Ревущий фьорд",
		["Аксерк - Ревущий фьорд"] = "Аксерк - Ревущий фьорд",
		["Зелюкс - Ревущий фьорд"] = "Зелюкс - Ревущий фьорд",
	},
	["profiles"] = {
		["Agonoíze - Stormscale"] = {
		},
		["Аганойз - Ревущий фьорд"] = {
		},
		["Аганойзи - Ревущий фьорд"] = {
		},
		["Нойзминау - Ревущий фьорд"] = {
		},
		["Аксерк - Ревущий фьорд"] = {
		},
		["Зелюкс - Ревущий фьорд"] = {
		},
	},
}
