
ActionBarSaverDB = {
	["restoreRank"] = false,
	["macro"] = false,
	["sets"] = {
		["HUNTER"] = {
		},
		["WARRIOR"] = {
		},
		["SHAMAN"] = {
		},
		["MAGE"] = {
		},
		["PRIEST"] = {
			["dc"] = {
				nil, -- [1]
				nil, -- [2]
				"macro|3|||135936|#showtooltip Подавление боли/n/закл Очищение зла", -- [3]
				"macro|4|||253400|#showtooltip Слово силы: Барьер/n/cast [harm]Кара ; Темное восстановление", -- [4]
				"macro|5|||237548|#showtooltip Вознесение/n/закл Контроль над разумом", -- [5]
				"item|173944||Запретный обсидиановый коготь", -- [6]
				"item|158320||Исцеляющий тотем вуду", -- [7]
				"macro|8|||1386546|#showtooltip Слово силы: Сияние/n/закл Кольцо света", -- [8]
				"macro|9|||136199|#showtooltip Порождение Света/n/cast Слово силы: Стойкость", -- [9]
				"macro|10|||1445237|#showtooltip Темный архангел(PvP-талант)/n/cast Красный боевой конь-скелет", -- [10]
				"macro|11|||136149|#showtooltip Предвестие(PvP-талант)/n/закл Сковывание нежити", -- [11]
				"macro|12|||1322720|#showtooltip Воля Отрекшихся(Расовая)/n/закл Воля Отрекшихся(Расовая)", -- [12]
				"macro|13|||136149|/console ScriptErrors 0", -- [13]
				"equipmentset|PvP|", -- [14]
				"equipmentset|PvE|", -- [15]
				[60] = "item|163784||Кокосовая вода с морской пеной",
				[61] = "macro|61|||237545|#showtooltip Исповедь/n/закл Слово силы: Щит",
				[62] = "macro|62|||612968|#showtooltip/n/cast Схизма",
				[17] = "item|168313||Картошка по-флотски",
				[66] = "macro|66|||3015740|#showtooltip/n/use Сущность сердца",
				[18] = "item|168652||Сильный настой бездонных глубин",
				[19] = "item|160053||Побывавшая в битве руна усиления",
				[20] = "item|153647||Фолиант спокойного разума",
				[27] = "macro|27||А!|134400|/target party1",
				[23] = "macro|23|||136199|#showtooltip Порождение Света/n/cast Слово силы: Стойкость",
				[29] = "macro|29|||135955|#showtooltip Воскрешение/n/закл Неуклонный ледяной покоритель",
				[24] = "item|172179||Камень возвращения вечного путника",
				[28] = "macro|28||A2|134400|/target party2",
				[49] = "macro|49|||237550|#showtooltip Ашжра'камас, Покров Решимости/n/use Ашжра'камас, Покров Решимости",
				[50] = "macro|50|||135894|#showtooltip Массовое рассеивание/n/закл [@cursor]Массовое рассеивание",
				[51] = "macro|51|||135944|#showtooltip Божественное Перышко/n/cast [@player]  Божественное Перышко",
				[52] = "macro|52|||463835|#showtooltip Духовное рвение/n/закл Левитация",
				[53] = "item|142406||Барабаны гор",
				[54] = "item|163784||Кокосовая вода с морской пеной",
				[55] = "macro|55|||237550|#showtooltip Молитва отчаяния/n/закл Молитва отчаяния/n/cancelaura Молитва отчаяния",
				[56] = "macro|56|||135894|#showtooltip /n/cast [harm]Рассеивание заклинаний; Очищение",
				[57] = "macro|57|||135944|#showtooltip Божественное Перышко/n/cast  Божественное Перышко",
				[71] = "macro|71|||136149|#showtooltip Предвестие(PvP-талант)/n/закл Предвестие(PvP-талант)",
			},
		},
		["PALADIN"] = {
		},
		["WARLOCK"] = {
		},
		["DEMONHUNTER"] = {
		},
		["DEATHKNIGHT"] = {
		},
		["DRUID"] = {
		},
		["MONK"] = {
		},
		["ROGUE"] = {
		},
	},
	["spellSubs"] = {
	},
	["checkCount"] = false,
}
