
ATTDB = {
	["glow"] = true,
	["growLeft"] = true,
	["showRacial"] = true,
	["scale"] = 0.8079524040222168,
	["showSelf"] = true,
	["maledict"] = true,
	["tworows"] = true,
	["lock"] = true,
	["positions"] = {
		{
			["y"] = -356.666618997624,
			["x"] = 374.4449356062614,
		}, -- [1]
		{
			["y"] = -442.7111989714103,
			["x"] = 404.3111729140946,
		}, -- [2]
		{
			["y"] = -543.6889967812385,
			["x"] = 388.6666605484788,
		}, -- [3]
		{
			["y"] = -598.4443536595427,
			["x"] = 387.9555247103053,
		}, -- [4]
		{
			["y"] = -309.7334389564276,
			["x"] = 375.1558334073343,
		}, -- [5]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [6]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [7]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [8]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [9]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [10]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [11]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [12]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [13]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [14]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [15]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [16]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [17]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [18]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [19]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [20]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [21]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [22]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [23]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [24]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [25]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [26]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [27]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [28]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [29]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [30]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [31]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [32]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [33]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [34]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [35]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [36]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [37]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [38]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [39]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [40]
		{
			["y"] = -377.9999800315272,
			["x"] = 676.666637777671,
		}, -- [41]
	},
	["showTooltip"] = false,
	["inraid"] = false,
	["showTrinket"] = true,
	["spite"] = false,
	["iconOffsetY"] = 2,
	["attach"] = true,
	["outside"] = true,
	["hidden"] = false,
	["dungeons"] = false,
	["arena"] = true,
	["abilities"] = {
		["DEATHKNIGHT"] = {
			["252"] = {
				{
					["ability"] = "Асфиксия",
					["cooldown"] = 45,
					["id"] = 108194,
				}, -- [1]
				{
					["ability"] = "Прыжок",
					["cooldown"] = 30,
					["id"] = 47482,
				}, -- [2]
			},
			["ALL"] = {
				{
					["ability"] = "Заморозка разума",
					["cooldown"] = 15,
					["id"] = 47528,
				}, -- [1]
				{
					["ability"] = "Антимагический панцирь",
					["cooldown"] = 60,
					["id"] = 48707,
				}, -- [2]
				{
					["ability"] = "Незыблемость льда",
					["cooldown"] = 180,
					["id"] = 48792,
				}, -- [3]
			},
			["250"] = {
			},
			["251"] = {
				{
					["ability"] = "Блуждающий дух",
					["cooldown"] = 60,
					["id"] = 212552,
				}, -- [1]
			},
		},
		["WARRIOR"] = {
			["71"] = {
				{
					["ability"] = "Устрашающий крик",
					["cooldown"] = 90,
					["id"] = 5246,
				}, -- [1]
				{
					["ability"] = "Бой насмерть",
					["cooldown"] = 180,
					["id"] = 118038,
				}, -- [2]
			},
			["ALL"] = {
				{
					["ability"] = "Зуботычина",
					["cooldown"] = 15,
					["id"] = 6552,
				}, -- [1]
				{
					["ability"] = "Обезоруживание",
					["cooldown"] = 45,
					["id"] = 236077,
				}, -- [2]
				{
					["ability"] = "Удар громовержца",
					["cooldown"] = 30,
					["id"] = 107570,
				}, -- [3]
			},
			["73"] = {
			},
			["72"] = {
				{
					["ability"] = "Устрашающий крик",
					["cooldown"] = 90,
					["id"] = 5246,
				}, -- [1]
			},
		},
		["ROGUE"] = {
			["261"] = {
				{
					["ability"] = "Ускользание",
					["cooldown"] = 120,
					["id"] = 5277,
				}, -- [1]
				{
					["ability"] = "Дымовая шашка",
					["cooldown"] = 180,
					["id"] = 212182,
				}, -- [2]
			},
			["260"] = {
			},
			["ALL"] = {
				{
					["ability"] = "Пинок",
					["cooldown"] = 15,
					["id"] = 1766,
				}, -- [1]
				{
					["ability"] = "Плащ Теней",
					["cooldown"] = 120,
					["id"] = 31224,
				}, -- [2]
			},
			["259"] = {
				{
					["ability"] = "Ускользание",
					["cooldown"] = 120,
					["id"] = 5277,
				}, -- [1]
				{
					["ability"] = "Ослепление",
					["cooldown"] = 120,
					["id"] = 2094,
				}, -- [2]
				{
					["ability"] = "Дымовая шашка",
					["cooldown"] = 180,
					["id"] = 212182,
				}, -- [3]
			},
		},
		["MAGE"] = {
			["ALL"] = {
				{
					["ability"] = "Барьер времени",
					["cooldown"] = 45,
					["id"] = 198111,
				}, -- [1]
				{
					["ability"] = "Антимагия",
					["cooldown"] = 24,
					["id"] = 2139,
				}, -- [2]
				{
					["ability"] = "Ледяная глыба",
					["cooldown"] = 240,
					["id"] = 45438,
				}, -- [3]
				{
					["ability"] = "Кольцо мороза",
					["cooldown"] = 45,
					["id"] = 113724,
				}, -- [4]
			},
			["64"] = {
			},
			["62"] = {
			},
			["63"] = {
				{
					["ability"] = "Дыхание дракона",
					["cooldown"] = 20,
					["id"] = 31661,
				}, -- [1]
			},
		},
		["PRIEST"] = {
			["ALL"] = {
			},
			["256"] = {
				{
					["ability"] = "Ментальный крик",
					["cooldown"] = 60,
					["id"] = 8122,
				}, -- [1]
				{
					["ability"] = "Подавление боли",
					["cooldown"] = 180,
					["id"] = 33206,
				}, -- [2]
				{
					["ability"] = "Слово силы: Барьер",
					["cooldown"] = 180,
					["id"] = 62618,
				}, -- [3]
			},
			["258"] = {
				{
					["ability"] = "Слияние с Тьмой",
					["cooldown"] = 120,
					["id"] = 47585,
				}, -- [1]
				{
					["ability"] = "Ментальный крик",
					["cooldown"] = 60,
					["id"] = 8122,
				}, -- [2]
				{
					["ability"] = "Безмолвие",
					["cooldown"] = 45,
					["id"] = 15487,
				}, -- [3]
			},
			["257"] = {
				{
					["ability"] = "Улучшенный уход в тень",
					["cooldown"] = 45,
					["id"] = 213602,
				}, -- [1]
				{
					["ability"] = "Луч надежды",
					["cooldown"] = 60,
					["id"] = 197268,
				}, -- [2]
				{
					["ability"] = "Оберегающий дух",
					["cooldown"] = 180,
					["id"] = 47788,
				}, -- [3]
			},
		},
		["HUNTER"] = {
			["254"] = {
			},
			["255"] = {
			},
			["253"] = {
			},
			["ALL"] = {
				{
					["ability"] = "Дух черепахи",
					["cooldown"] = 180,
					["id"] = 186265,
				}, -- [1]
				{
					["ability"] = "Замораживающая ловушка",
					["cooldown"] = 30,
					["id"] = 187650,
				}, -- [2]
				{
					["ability"] = "Рев жертвенности",
					["cooldown"] = 60,
					["id"] = 53480,
				}, -- [3]
			},
		},
		["GENERAL"] = {
			["ALL"] = {
				{
					["ability"] = "Темный фетиш гладиатора",
					["cooldown"] = 120,
					["id"] = 305252,
				}, -- [1]
				{
					["ability"] = "Оберег гладиатора",
					["cooldown"] = 120,
					["id"] = 286342,
				}, -- [2]
			},
		},
		["WARLOCK"] = {
			["265"] = {
			},
			["ALL"] = {
				{
					["ability"] = "Запрет чар",
					["cooldown"] = 24,
					["id"] = 19647,
				}, -- [1]
				{
					["ability"] = "Твердая решимость",
					["cooldown"] = 180,
					["id"] = 104773,
				}, -- [2]
				{
					["ability"] = "Темный пакт",
					["cooldown"] = 60,
					["id"] = 108416,
				}, -- [3]
				{
					["ability"] = "Оберег Пустоты",
					["cooldown"] = 45,
					["id"] = 212295,
				}, -- [4]
			},
			["267"] = {
			},
			["266"] = {
			},
		},
		["DEMONHUNTER"] = {
			["ALL"] = {
				{
					["ability"] = "Затуманивание",
					["cooldown"] = 60,
					["id"] = 198589,
				}, -- [1]
				{
					["ability"] = "Прерывание",
					["cooldown"] = 10,
					["id"] = 183752,
				}, -- [2]
				{
					["ability"] = "Пленение",
					["cooldown"] = 45,
					["id"] = 217832,
				}, -- [3]
			},
			["581"] = {
			},
			["577"] = {
				{
					["ability"] = "Мрак",
					["cooldown"] = 180,
					["id"] = 196718,
				}, -- [1]
			},
		},
		["SHAMAN"] = {
			["ALL"] = {
				{
					["ability"] = "Астральный сдвиг",
					["cooldown"] = 90,
					["id"] = 108271,
				}, -- [1]
				{
					["ability"] = "Пронизывающий ветер",
					["cooldown"] = 12,
					["id"] = 57994,
				}, -- [2]
				{
					["ability"] = "Перерождение",
					["cooldown"] = 180,
					["id"] = 114052,
				}, -- [3]
			},
			["264"] = {
				{
					["ability"] = "Тотем духовной связи",
					["cooldown"] = 180,
					["id"] = 98008,
				}, -- [1]
				{
					["ability"] = "Тотем земляной стены",
					["cooldown"] = 60,
					["id"] = 198838,
				}, -- [2]
			},
			["263"] = {
			},
			["262"] = {
			},
		},
		["DRUID"] = {
			["105"] = {
				{
					["ability"] = "Дубовая кожа",
					["cooldown"] = 60,
					["id"] = 22812,
				}, -- [1]
				{
					["ability"] = "Железная кора",
					["cooldown"] = 60,
					["id"] = 102342,
				}, -- [2]
			},
			["104"] = {
			},
			["ALL"] = {
				{
					["ability"] = "Мощное оглушение",
					["cooldown"] = 50,
					["id"] = 5211,
				}, -- [1]
			},
			["103"] = {
				{
					["ability"] = "Лобовая атака",
					["cooldown"] = 15,
					["id"] = 106839,
				}, -- [1]
				{
					["maxcharges"] = 2,
					["ability"] = "Инстинкты выживания",
					["cooldown"] = 120,
					["id"] = 61336,
				}, -- [2]
			},
			["102"] = {
				{
					["ability"] = "Столп солнечного света",
					["cooldown"] = 60,
					["id"] = 78675,
				}, -- [1]
				{
					["ability"] = "Дубовая кожа",
					["cooldown"] = 60,
					["id"] = 22812,
				}, -- [2]
			},
		},
		["MONK"] = {
			["270"] = {
				{
					["ability"] = "Исцеляющий кокон",
					["cooldown"] = 120,
					["id"] = 116849,
				}, -- [1]
			},
			["269"] = {
				{
					["ability"] = "Рука-копье",
					["cooldown"] = 15,
					["id"] = 116705,
				}, -- [1]
				{
					["ability"] = "Закон кармы",
					["cooldown"] = 90,
					["id"] = 122470,
				}, -- [2]
				{
					["ability"] = "Укрепляющий отвар",
					["cooldown"] = 90,
					["id"] = 201318,
				}, -- [3]
			},
			["268"] = {
			},
			["ALL"] = {
				{
					["ability"] = "Круговой удар ногой",
					["cooldown"] = 60,
					["id"] = 119381,
				}, -- [1]
			},
		},
		["PALADIN"] = {
			["65"] = {
				{
					["ability"] = "Жертвенное благословение",
					["cooldown"] = 120,
					["id"] = 6940,
				}, -- [1]
				{
					["ability"] = "Божественный щит",
					["cooldown"] = 300,
					["id"] = 642,
				}, -- [2]
				{
					["ability"] = "Рыцарь-мститель",
					["cooldown"] = 120,
					["id"] = 216331,
				}, -- [3]
				{
					["ability"] = "Благословение защиты",
					["cooldown"] = 300,
					["id"] = 1022,
				}, -- [4]
				{
					["ability"] = "Благословенная свобода",
					["cooldown"] = 25,
					["id"] = 1044,
				}, -- [5]
			},
			["70"] = {
				{
					["ability"] = "Божественный щит",
					["cooldown"] = 300,
					["id"] = 642,
				}, -- [1]
				{
					["ability"] = "Укор",
					["cooldown"] = 15,
					["id"] = 96231,
				}, -- [2]
				{
					["ability"] = "Благословение защиты",
					["cooldown"] = 300,
					["id"] = 1022,
				}, -- [3]
				{
					["ability"] = "Благословенная свобода",
					["cooldown"] = 25,
					["id"] = 1044,
				}, -- [4]
				{
					["ability"] = "Благословение святилища",
					["cooldown"] = 45,
					["id"] = 210256,
				}, -- [5]
				{
					["ability"] = "Око за око",
					["cooldown"] = 60,
					["id"] = 205191,
				}, -- [6]
			},
			["ALL"] = {
				{
					["ability"] = "Молот правосудия",
					["cooldown"] = 60,
					["id"] = 853,
				}, -- [1]
			},
			["66"] = {
				{
					["ability"] = "Укор",
					["cooldown"] = 15,
					["id"] = 96231,
				}, -- [1]
			},
		},
	},
	["scenarios"] = false,
	["showIconBorders"] = false,
	["iconOffsetX"] = 5,
	["horizontal"] = false,
	["dampening"] = false,
	["classSelected"] = "WARRIOR",
}
