
EasyFramesDB = {
	["profileKeys"] = {
		["Ваззапер - Ревущий фьорд"] = "Default",
		["Семеста - Ревущий фьорд"] = "Default",
		["Комабекфаер - Черный Шрам"] = "Default",
		["Фасрок - Черный Шрам"] = "Default",
		["Флинтомист - Ревущий фьорд"] = "Default",
		["Кендифлоп - Ревущий фьорд"] = "Default",
		["Калимистх - Ревущий фьорд"] = "Default",
		["Мушкетер - Черный Шрам"] = "Default",
		["Валфрия - Ревущий фьорд"] = "Default",
	},
	["profiles"] = {
		["Default"] = {
			["general"] = {
				["barTexture"] = "BantoBar",
			},
		},
	},
}
