
VExRT = {
	["BattleRes"] = {
	},
	["ProfileKeys"] = {
		["Флинтомист-Ревущийфьорд"] = "default",
		["Клиндамист-Ревущийфьорд"] = "default",
		["Валфрия-Ревущийфьорд"] = "default",
		["Итсафлейм-ЧерныйШрам"] = "default",
		["Семеста-Ревущийфьорд"] = "default",
		["Кендифлоп-Ревущийфьорд"] = "default",
		["Ваззапер-ЧерныйШрам"] = "default",
		["Мушкетерх-Ревущийфьорд"] = "default",
		["Ваззапер-Ревущийфьорд"] = "default",
		["Калимистх-Ревущийфьорд"] = "default",
		["Сноха-Ревущийфьорд"] = "default",
		["Комабекфаер-ЧерныйШрам"] = "default",
		["Валфрия-Гордунни"] = "default",
	},
	["Encounter"] = {
		["list"] = {
			["Флинтомист"] = {
				"^2329^15^1592586407^138^1^25^467.04^Proxeh-TwistingNether", -- [1]
				"^2327^15^1592586796^8^0^25^467.00^", -- [2]
				"^2327^15^1592586860^9^0^25^467.00^", -- [3]
				"^2327^15^1592586953^171^1^25^467.00^Proxeh-TwistingNether", -- [4]
				"^2334^15^1592587546^189^1^25^467.08^Proxeh-TwistingNether", -- [5]
				"^2328^15^1592588439^7^0^26^466.23^", -- [6]
				"^2328^15^1592588558^228^1^26^466.29^Киури", -- [7]
				"^2336^15^1592588980^15^0^26^466.25^", -- [8]
				"^2336^15^1592589197^266^1^26^466.19^Proxeh-TwistingNether", -- [9]
				"^2333^15^1592589674^8^0^26^465.98^", -- [10]
				"^2333^15^1592589736^4^0^26^465.98^", -- [11]
				"^2333^15^1592589798^4^0^26^465.98^", -- [12]
				"^2333^15^1592589870^4^0^26^465.98^", -- [13]
				"^2337^15^1592590176^474^1^26^469.53^Медвежаткин-Галакронд", -- [14]
				"^2344^15^1592590891^608^1^26^469.78^Odeen-Kazzak", -- [15]
				"^2333^15^1592591784^212^1^26^466.73^Киури", -- [16]
				"^2331^15^1592592173^8^0^26^466.75^Odeen-Kazzak", -- [17]
				"^2331^15^1592592248^8^0^26^466.75^", -- [18]
				"^2331^15^1592592329^205^1^26^466.77^Proxeh-TwistingNether", -- [19]
				"^2343^15^1592592896^236^1^26^466.93^Proxeh-TwistingNether", -- [20]
				"^2335^15^1592593397^200^1^26^467.64^Душирог", -- [21]
				"^2345^15^1592593827^394^1^26^467.44^Мохнатыйптиц-Гордунни", -- [22]
				"^2257^8^1592671876^136^1^5^469.82^Баклосан", -- [23]
				"^2258^8^1592672237^160^1^5^469.82^", -- [24]
				"^2259^8^1592672687^171^1^5^469.82^Движения", -- [25]
				"^2260^8^1592673247^228^1^5^469.82^", -- [26]
				"^2281^16^1592677046^43^0^20^473.78^Dranøsh-Mal'Ganis", -- [27]
				"^2281^16^1592677121^38^0^20^473.92^Gàttsu-Ysondre", -- [28]
				"^2281^16^1592677782^65^0^20^474.81^Schlugo-TarrenMill", -- [29]
				"^2281^16^1592677880^339^0^20^474.81^Абдулл-СвежевательДуш", -- [30]
				"^2281^16^1592678275^35^0^20^474.81^Венторум", -- [31]
				"^2281^16^1592678346^287^1^20^474.81^Schlugo-TarrenMill", -- [32]
				"^730^4^1592845915^24^1^25^474.69^", -- [33]
				"^733^4^1592846031^241^1^25^474.69^", -- [34]
				"^663^9^1593009427^0^1^40^470.31^", -- [35]
				"^664^9^1593009437^0^1^40^470.31^", -- [36]
				"^665^9^1593009571^0^1^40^470.31^", -- [37]
				"^666^9^1593009600^3^1^40^470.31^", -- [38]
				"^668^9^1593009651^0^1^40^470.31^", -- [39]
				"^667^9^1593009663^0^1^40^470.31^", -- [40]
				"^669^9^1593009751^0^1^40^470.31^", -- [41]
				"^670^9^1593009787^0^1^40^470.31^", -- [42]
				"^671^9^1593009852^4^1^40^470.31^", -- [43]
				"^672^9^1593010147^1^1^40^470.31^", -- [44]
				"^610^9^1593010280^5^0^40^470.31^", -- [45]
				"^610^9^1593010346^4^1^40^470.31^", -- [46]
				"^611^9^1593010423^2^1^40^470.31^", -- [47]
				"^612^9^1593010586^0^1^40^470.31^", -- [48]
				"^613^9^1593010609^0^1^40^470.31^", -- [49]
				"^614^9^1593010639^0^1^40^470.31^", -- [50]
				"^616^9^1593010672^2^1^40^470.31^", -- [51]
				"^617^9^1593010719^79^1^40^470.31^", -- [52]
				"^653^3^1593365591^0^1^10^468.25^", -- [53]
				"^652^3^1593365670^7^1^10^468.25^", -- [54]
				"^654^3^1593365830^0^1^10^468.25^", -- [55]
				"^655^3^1593366098^87^1^10^468.25^", -- [56]
				"^656^3^1593366384^0^1^10^468.25^", -- [57]
				"^658^3^1593366525^0^1^10^468.25^", -- [58]
				"^659^3^1593366626^0^1^10^468.25^", -- [59]
				"^2105^8^1593460585^71^1^5^472.64^", -- [60]
				"^2106^8^1593461260^59^1^5^472.64^", -- [61]
				"^2107^8^1593461476^73^1^5^472.64^Руинити", -- [62]
				"^2108^8^1593461692^111^1^5^472.64^", -- [63]
				"^2257^8^1593462297^91^1^5^472.64^", -- [64]
				"^2258^8^1593462521^75^1^5^472.64^", -- [65]
				"^2259^8^1593462980^111^1^5^472.64^Кисапал", -- [66]
				"^2260^8^1593463385^139^1^5^472.64^Кисапал", -- [67]
				"^2344^15^1593524988^118^0^10^441.29^Espérada-Hyjal", -- [68]
				"^2344^15^1593525162^530^0^10^441.29^Pimmorc-Ragnaros", -- [69]
				"^2344^15^1593526255^535^1^10^439.56^Zaël-Blackrock", -- [70]
				"^2329^15^1593530812^247^1^21^463.80^Tronícs-Blackhand", -- [71]
				"^2327^15^1593531479^211^1^21^463.37^Фэибл-Ясеневыйлес", -- [72]
				"^2334^15^1593532506^208^0^20^462.13^Cavdrood-Blackmoore", -- [73]
				"^2139^8^1593627629^93^1^5^473.88^", -- [74]
				"^2142^8^1593628234^110^1^5^473.88^", -- [75]
				"^2140^8^1593628670^201^1^5^473.88^", -- [76]
				"^2143^8^1593629063^176^1^5^473.88^Боротор-СвежевательДуш", -- [77]
				"^663^9^1593630401^0^1^40^472.63^", -- [78]
				"^664^9^1593630419^0^1^40^472.63^", -- [79]
				"^665^9^1593630522^0^1^40^472.63^", -- [80]
				"^666^9^1593630584^3^1^40^472.63^", -- [81]
				"^667^9^1593630640^0^1^40^472.63^", -- [82]
				"^668^9^1593630650^0^1^40^472.63^", -- [83]
				"^610^9^1593630851^3^0^40^472.63^", -- [84]
				"^610^9^1593630903^2^1^40^472.63^", -- [85]
				"^611^9^1593630993^1^1^40^472.63^", -- [86]
				"^612^9^1593631317^0^1^40^472.63^", -- [87]
				"^613^9^1593631362^0^1^40^472.63^", -- [88]
				"^614^9^1593631394^0^1^40^472.63^", -- [89]
				"^615^9^1593631402^0^1^40^472.63^", -- [90]
				"^616^9^1593631426^0^1^40^472.63^", -- [91]
				"^617^9^1593631475^79^1^40^472.63^", -- [92]
				"^2257^8^1593636848^106^1^5^473.94^", -- [93]
				"^2258^8^1593637081^110^1^5^473.94^", -- [94]
				"^2259^8^1593637535^207^1^5^473.94^Флинтомист", -- [95]
				"^2260^8^1593638046^190^1^5^473.94^Кисапал", -- [96]
				"^2130^8^1593639135^132^1^5^474.00^Руинити", -- [97]
				"^2131^8^1593639551^134^1^5^474.00^", -- [98]
				"^2132^8^1593640039^91^1^5^474.00^", -- [99]
				"^2133^8^1593640245^103^1^5^474.00^", -- [100]
				"^2257^8^1593699583^139^1^5^474.10^", -- [101]
				"^2258^8^1593699970^136^1^5^474.10^", -- [102]
				"^2259^8^1593700393^118^1^5^474.10^Obidaya-Cho'gall", -- [103]
				"^2260^8^1593700909^245^1^5^474.10^Johnweack-Hyjal", -- [104]
			},
			["Ваззапер"] = {
			},
			["Мушкетерх"] = {
			},
			["Комабекфаер"] = {
				"^610^9^1593633301^17^0^40^260.19^", -- [1]
				"^610^9^1593633373^1^1^40^260.19^", -- [2]
				"^611^9^1593633448^4^1^40^260.19^", -- [3]
			},
			["Сноха"] = {
				"^1939^2^1593434580^57^1^5^198.03^", -- [1]
				"^1941^2^1593434855^53^1^5^198.03^", -- [2]
				"^1940^2^1593435173^55^1^5^267.96^", -- [3]
			},
			["Калимистх"] = {
				"^663^9^1593011385^0^1^40^453.00^", -- [1]
				"^665^9^1593011494^0^1^40^453.00^", -- [2]
				"^666^9^1593011523^0^1^40^453.00^", -- [3]
				"^667^9^1593011571^0^1^40^453.00^", -- [4]
				"^610^9^1593011705^2^0^40^453.00^", -- [5]
				"^610^9^1593011767^6^1^40^453.00^", -- [6]
				"^611^9^1593011841^2^1^40^453.00^", -- [7]
				"^612^9^1593011926^0^1^40^453.00^", -- [8]
				"^613^9^1593011937^0^1^40^453.00^", -- [9]
				"^614^9^1593011969^1^1^40^453.00^", -- [10]
				"^616^9^1593011993^0^1^40^453.00^", -- [11]
				"^665^9^1593632114^0^1^40^453.00^", -- [12]
				"^666^9^1593632143^0^1^40^453.00^", -- [13]
				"^667^9^1593632193^0^1^40^453.00^", -- [14]
				"^668^9^1593632211^1^1^40^453.00^", -- [15]
				"^610^9^1593632413^12^0^40^453.00^", -- [16]
				"^610^9^1593632487^1^1^40^453.00^", -- [17]
				"^611^9^1593632570^2^1^40^453.00^", -- [18]
				"^612^9^1593632722^0^1^40^453.00^", -- [19]
				"^613^9^1593632736^0^1^40^453.00^", -- [20]
				"^614^9^1593632755^0^1^40^453.00^", -- [21]
				"^615^9^1593632765^1^1^40^453.00^", -- [22]
			},
			["Клиндамист"] = {
				"^1064^1^1593381882^64^1^5^12.36^", -- [1]
				"^1065^1^1593382230^65^1^5^12.81^", -- [2]
				"^1063^1^1593382511^63^1^5^12.90^", -- [3]
				"^1062^1^1593382942^90^1^5^12.94^", -- [4]
				"^1060^1^1593383043^45^1^5^13.32^", -- [5]
				"^585^1^1593383466^68^1^5^15.11^", -- [6]
				"^589^1^1593383842^45^1^5^14.83^", -- [7]
				"^590^1^1593384305^36^1^5^16.73^", -- [8]
				"^591^1^1593384352^49^1^5^16.86^", -- [9]
				"^587^1^1593384426^30^1^5^17.01^", -- [10]
				"^588^1^1593384567^48^1^5^17.25^", -- [11]
				"^586^1^1593384863^28^1^5^17.68^", -- [12]
				"^592^1^1593385228^61^1^5^18.35^", -- [13]
			},
			["Валфрия"] = {
			},
			["Кендифлоп"] = {
				"^2329^15^1593083996^98^1^21^466.51^", -- [1]
				"^2327^15^1593084334^10^0^21^475.08^", -- [2]
				"^2327^15^1593084402^82^1^21^475.08^Elvira-Dentarg", -- [3]
				"^2334^15^1593084948^88^0^24^475.40^Djroyce-Kazzak", -- [4]
				"^2334^15^1593085203^192^0^24^475.40^Ðnz-Draenor", -- [5]
				"^2334^15^1593085585^126^1^22^475.26^Ðnz-Draenor", -- [6]
				"^2328^15^1593086215^5^0^22^475.36^", -- [7]
				"^2328^15^1593086251^5^0^22^475.36^", -- [8]
				"^2328^15^1593086308^154^1^22^475.39^Sayrah-TarrenMill", -- [9]
				"^2336^15^1593086667^16^0^22^475.16^", -- [10]
				"^2336^15^1593086750^132^1^21^475.16^Sayrah-TarrenMill", -- [11]
				"^663^9^1593719928^0^1^40^464.88^", -- [12]
				"^664^9^1593719974^0^1^40^464.88^", -- [13]
				"^665^9^1593720067^0^1^40^464.88^", -- [14]
				"^666^9^1593720115^0^1^40^464.88^", -- [15]
				"^668^9^1593720164^0^1^40^464.88^", -- [16]
				"^667^9^1593720202^1^1^40^464.88^", -- [17]
				"^669^9^1593720303^1^1^40^464.88^", -- [18]
				"^670^9^1593720337^1^1^40^464.88^", -- [19]
				"^671^9^1593720410^4^1^40^464.88^", -- [20]
				"^672^9^1593720960^1^1^40^464.88^", -- [21]
				"^610^9^1593721110^4^0^40^464.88^", -- [22]
				"^610^9^1593721169^2^1^40^464.88^", -- [23]
				"^611^9^1593721250^0^1^40^464.88^", -- [24]
				"^612^9^1593721381^0^1^40^464.88^", -- [25]
				"^613^9^1593721411^0^1^40^464.88^", -- [26]
				"^614^9^1593721437^0^1^40^464.88^", -- [27]
				"^616^9^1593721472^2^1^40^464.88^", -- [28]
				"^617^9^1593721515^75^1^40^464.88^", -- [29]
			},
			["Семеста"] = {
				"^2344^15^1592868862^597^1^14^464.30^Cinui-Stormscale", -- [1]
				"^2111^8^1592944318^94^1^5^477.40^", -- [2]
				"^2118^8^1592944714^163^1^5^477.40^", -- [3]
				"^2112^8^1592945119^167^1^5^477.40^Сабомчикова-СвежевательДуш", -- [4]
				"^2123^8^1592945790^210^1^5^477.40^Fireblade-Lightbringer", -- [5]
				"^2281^16^1593017000^301^1^20^471.57^Ксилиэль", -- [6]
				"^2329^16^1593017896^177^0^20^465.40^Зацапцарапаю", -- [7]
				"^2329^16^1593018168^347^0^20^465.40^Лысыймачо", -- [8]
				"^2329^16^1593018585^333^1^20^468.38^Зацапцарапаю", -- [9]
				"^2334^16^1593019217^179^1^20^468.38^", -- [10]
				"^2327^16^1593020045^65^0^20^468.37^Биотеша", -- [11]
				"^2327^16^1593020209^210^1^20^468.37^Урамар", -- [12]
				"^2335^16^1593021237^12^0^20^471.41^Мемныйдх", -- [13]
				"^2335^16^1593022011^238^1^20^471.80^Венторум", -- [14]
				"^2333^16^1593022786^228^1^20^471.83^Биотеша", -- [15]
				"^2331^16^1593023571^48^0^20^471.84^Семеста", -- [16]
				"^2331^16^1593023681^152^0^20^471.84^Гассай", -- [17]
				"^2331^16^1593023955^81^0^20^472.00^Похильтеменя", -- [18]
				"^2331^16^1593024490^140^0^20^472.06^Венторум", -- [19]
				"^2331^16^1593024688^119^0^20^472.06^Теребоньтий", -- [20]
				"^2331^16^1593024900^78^0^20^472.09^Мемныйдх", -- [21]
				"^2331^16^1593025036^142^0^20^472.09^Венторум", -- [22]
				"^2331^16^1593025272^251^0^20^472.09^Гассай", -- [23]
				"^2331^16^1593025656^99^0^20^472.09^Койотпитерсн", -- [24]
				"^2331^16^1593025846^88^0^20^472.12^Лысыймачо", -- [25]
				"^2331^16^1593026001^243^1^20^472.12^Урамар", -- [26]
				"^2328^16^1593026786^123^0^20^471.89^Лысыймачо", -- [27]
				"^2328^16^1593027144^224^0^20^471.85^Керьли", -- [28]
				"^2328^16^1593027925^1^0^20^471.34^", -- [29]
				"^2328^16^1593105749^49^0^20^476.77^Семеста", -- [30]
				"^2328^16^1593105863^275^0^20^476.77^Семеста", -- [31]
				"^2328^16^1593106239^49^0^20^476.77^Семеста", -- [32]
				"^2328^16^1593106372^40^0^20^476.77^Венторум", -- [33]
				"^2328^16^1593106506^267^1^20^476.74^Гассай", -- [34]
				"^2336^16^1593107002^15^0^20^476.80^Семеста", -- [35]
				"^2336^16^1593107443^204^0^20^476.74^Биотеша", -- [36]
				"^2336^16^1593107712^276^0^20^476.74^Урамар", -- [37]
				"^2336^16^1593108080^273^0^20^476.74^Хилизгермани", -- [38]
				"^2336^16^1593108441^373^1^20^476.85^Улькиори", -- [39]
				"^2343^16^1593109876^346^0^20^476.78^Койотпитерсн", -- [40]
				"^2343^16^1593110314^172^0^20^476.78^Биотеша", -- [41]
				"^2343^16^1593110645^344^0^20^476.78^Семеста", -- [42]
				"^2343^16^1593111069^507^1^20^476.78^Урамар", -- [43]
				"^2345^16^1593112112^300^0^20^476.67^Венторум", -- [44]
				"^2345^16^1593112511^235^0^20^476.70^Урамар", -- [45]
				"^2345^16^1593112839^294^0^20^476.70^Гассай", -- [46]
				"^2345^16^1593113269^222^0^20^476.70^Бареон", -- [47]
				"^2139^8^1593454886^113^1^5^476.69^", -- [48]
				"^2142^8^1593455563^108^1^5^476.69^", -- [49]
				"^2140^8^1593456042^107^0^5^476.69^Васявыручай", -- [50]
				"^2140^8^1593456410^172^1^5^476.69^", -- [51]
				"^2143^8^1593456853^149^1^5^476.69^", -- [52]
				"^2329^15^1593605688^219^1^20^472.56^Швпна", -- [53]
				"^2327^15^1593606211^15^0^20^470.91^", -- [54]
				"^2327^15^1593606327^9^0^20^470.91^", -- [55]
				"^2327^15^1593606442^176^1^20^470.91^Вавелина", -- [56]
				"^2334^15^1593606946^173^1^21^472.36^", -- [57]
				"^2328^15^1593607732^5^0^21^472.83^", -- [58]
				"^2328^15^1593607791^224^1^21^472.83^Ohsogoõd-TwistingNether", -- [59]
				"^2336^15^1593608225^16^0^21^472.83^", -- [60]
				"^2336^15^1593608333^248^1^21^473.26^Ohsogoõd-TwistingNether", -- [61]
				"^2333^15^1593608895^5^0^21^473.63^", -- [62]
				"^2333^15^1593609015^5^0^21^473.63^", -- [63]
				"^2333^15^1593609053^5^0^21^473.63^", -- [64]
				"^2333^15^1593609093^25^0^21^473.63^", -- [65]
				"^2333^15^1593609156^5^0^21^473.64^", -- [66]
				"^2333^15^1593609195^10^0^21^473.64^", -- [67]
				"^2333^15^1593609241^5^0^21^473.64^", -- [68]
				"^2333^15^1593609284^22^0^21^473.64^", -- [69]
				"^2333^15^1593609342^5^0^21^473.64^", -- [70]
				"^2333^15^1593609384^5^0^21^473.64^", -- [71]
				"^2335^15^1593609477^201^1^21^473.64^Апетитьки-СвежевательДуш", -- [72]
				"^2343^15^1593609906^256^1^21^473.64^", -- [73]
				"^2345^15^1593610272^13^0^21^473.64^", -- [74]
				"^2345^15^1593610364^416^1^21^473.64^Ддц", -- [75]
				"^2333^15^1593611205^199^1^21^473.75^", -- [76]
				"^2331^15^1593611600^11^0^21^473.75^Гвиниверр-СвежевательДуш", -- [77]
				"^2331^15^1593611659^9^0^21^473.75^", -- [78]
				"^2331^15^1593611786^220^1^21^473.75^Smashipally-Sen'jin", -- [79]
				"^2337^15^1593612322^415^1^24^473.61^Ohsogoõd-TwistingNether", -- [80]
				"^2344^15^1593612924^285^0^24^473.61^Smashipally-Sen'jin", -- [81]
				"^2344^15^1593613280^525^1^24^473.61^Smashipally-Sen'jin", -- [82]
				"^2281^16^1593622513^275^1^20^475.59^Мемныйдх", -- [83]
				"^2327^16^1593623199^88^0^20^472.95^Семеста", -- [84]
				"^2327^16^1593623451^280^0^20^472.92^Bonanos-TarrenMill", -- [85]
				"^2327^16^1593624012^275^1^20^473.02^Bonanos-TarrenMill", -- [86]
				"^2334^16^1593625212^186^1^20^472.51^Reeyka-Kazzak", -- [87]
				"^2130^8^1593714304^79^1^5^474.56^", -- [88]
				"^2131^8^1593714587^112^1^5^474.56^", -- [89]
				"^2132^8^1593715013^103^1^5^474.56^", -- [90]
				"^2133^8^1593715216^106^1^5^475.60^", -- [91]
				"^2105^8^1593716306^122^1^5^477.34^", -- [92]
				"^2106^8^1593717022^123^1^5^477.34^", -- [93]
				"^2107^8^1593717288^123^1^5^477.34^Семеста", -- [94]
				"^2108^8^1593717548^202^1^5^479.10^Кисакун", -- [95]
			},
			["Итсафлейм"] = {
			},
		},
		["names"] = {
			[591] = "Вердан Вечноживущий",
			[1063] = "Врагорез-5000",
			[2142] = "Мчимба Бальзамировщик",
			[615] = "Пламегор",
			[2333] = "Коллективный разум",
			[2111] = "Старейшина Ликса",
			[2143] = "Король Дазар",
			[2334] = "Пророк Скитра",
			[2112] = "Заклинатель спор Занча",
			[671] = "Мажордом Экзекутус",
			[2335] = "Шад'хар Ненасытный",
			[592] = "Мутанус Пожиратель",
			[1065] = "Хеликс Отломчикс",
			[616] = "Хромаггус",
			[2337] = "Панцирь Н'Зота",
			[656] = "Смотритель",
			[664] = "Магмадар",
			[672] = "Рагнарос",
			[585] = "Леди Анакондра",
			[1940] = "Зыбун",
			[2118] = "Кроглот Зараженный",
			[617] = "Нефариан",
			[1941] = "Рокмар Трескун",
			[665] = "Гееннас",
			[2343] = "Дест'агат",
			[586] = "Лорд Кобран",
			[2344] = "Н'Зот Заразитель",
			[610] = "Бритвосмерт Неукротимый",
			[2345] = "Ил'гинот, Возрожденная Порча",
			[2123] = "Освобожденное чудовище",
			[658] = "Тень Арана",
			[666] = "Гарр",
			[587] = "Криг",
			[730] = "Ал'ар",
			[611] = "Валестраз Порочный",
			[659] = "Гнев Пустоты",
			[667] = "Шаззрах",
			[588] = "Лорд Питонас",
			[2257] = "Меха-месиво",
			[612] = "Предводитель драконов Разящий Бич",
			[2258] = "КУ-ДЖ0",
			[652] = "Ловчий Аттумен",
			[668] = "Барон Геддон",
			[2260] = "Король Мехагон",
			[2259] = "Сад машиниста",
			[589] = "Шкам",
			[1064] = "Глубток",
			[2131] = "Совет жрецов моря",
			[613] = "Огнечрев",
			[655] = "Оперный зал",
			[670] = "Големагг Испепелитель",
			[2108] = "Шеф Разданк",
			[2336] = "Вексиона",
			[653] = "Мороуз",
			[1060] = "\"Капитан\" Пирожок",
			[669] = "Предвестник Сульфурон",
			[2281] = "Леди Джайна Праудмур",
			[2327] = "Маут",
			[2105] = "Платный разгонятель толпы",
			[1939] = "Менну Предатель",
			[2328] = "Темный инквизитор Занеш",
			[590] = "Лорд Серпентис",
			[2106] = "Азерокк",
			[733] = "Кель'тас Солнечный Скиталец",
			[614] = "Черноскал",
			[2329] = "Гневион",
			[2107] = "Рикса Огневерт",
			[2139] = "Золотой Змей",
			[663] = "Люцифрон",
			[654] = "Благочестивая дева",
			[1062] = "Адмирал Терзающий Рев",
			[2140] = "Совет племен",
			[2130] = "Аква'сирр",
			[2331] = "Ра-ден Отчаявшийся",
			[2132] = "Лорд Штормсонг",
			[2133] = "Вол'зит Шепчущая",
		},
	},
	["Marks"] = {
		["list"] = {
		},
	},
	["Coins"] = {
		["list"] = {
			"!A174132Локтарща-СвежевательДуш1592587131:4:4823:1502:4786:6508", -- [1]
			"!9172190Киури1592588796:5:4823:6516:6515:1502:4786", -- [2]
			"!4172227Тыхашка1592590667:6:4823:6544:6578:6579:1502:4786", -- [3]
			"!9174127Justsaucee-Kazzak1592590672:5:4823:6516:6513:1502:4786", -- [4]
			"!4174136Proxeh-TwistingNether1592590725:4:4823:1502:4786:6507", -- [5]
			"!A174133Локтарща-СвежевательДуш1592591518:4:4823:1502:4786:6509", -- [6]
			"!B174533Медвежаткин-Галакронд1592591518:7:4823:1808:40:6516:6515:1502:4786", -- [7]
			"!9174103Хасуго1592591536:4:4823:6515:1502:4786", -- [8]
			"!C172197Ослабление1592592546:6:4823:6569:6578:6579:1502:4786", -- [9]
			"!4174146Душирог1592593153:7:4823:6578:6579:6540:6515:1502:4786", -- [10]
			"!3165831Каминам1592678644:4:4824:1537:4786:5419", -- [11]
			"!3165831Cessedie-Blackhand1592678672:4:4824:1537:4786:5419", -- [12]
			"!2174277Fischíí-Blackhand1592869469:4:4823:6513:1502:4786", -- [13]
			"!2174533Athenx-Draenor1592869470:6:4823:1808:6516:6513:1502:4786", -- [14]
			"!1174167Пашадикийвар-СтражСмерти1592869474:4:4823:1502:4786:6508", -- [15]
			"!5174125Биотеша1593018930:5:4824:6516:6515:1517:4786", -- [16]
			"!8174119Керьли1593019404:4:4824:1517:4786:6510", -- [17]
			"!C174143Мемныйдх1593019406:8:4824:6578:6579:6493:6612:6515:1517:4786", -- [18]
			"!4174141Кельдайна1593020448:5:4824:6516:6515:1517:4786", -- [19]
			"!3174530Койотпитерсн1593023040:6:4824:41:6516:6515:1517:4786", -- [20]
			"!8174128Акорат1593026251:5:4824:6516:6515:1517:4786", -- [21]
			"!C174500Папущен1593026254:5:4824:1808:6513:1517:4786", -- [22]
			"!6174500Кровоточка-Галакронд1593026255:4:4824:6515:1517:4786", -- [23]
			"!4174500Хетшесит1593026261:4:4824:6515:1517:4786", -- [24]
			"!3174528Каминам1593026335:4:4824:6513:1517:4786", -- [25]
			"!3174149Теребоньтий1593026403:4:4824:1517:4786:6512", -- [26]
			"!2173944Кендифлоп1593084490:4:4823:6515:1502:4786", -- [27]
			"!3174155Mageet-TwistingNether1593084498:6:4823:1808:6516:6513:1502:4786", -- [28]
			"!C174140Pûella-Aszune1593086486:5:4823:6516:6515:1502:4786", -- [29]
			"!2174164Кендифлоп1593086889:4:4823:1502:4786:6507", -- [30]
			"!9174126Гассай1593106789:5:4824:6516:6515:1517:4786", -- [31]
			"!5174121Семеста1593106796:5:4824:6516:6515:1517:4786", -- [32]
			"!3174148Лысыймачо1593108825:4:4824:1517:4786:6511", -- [33]
			"!B174131Алпарон1593108847:4:4824:1517:4786:6510", -- [34]
			"!1174533Булкавар-Ясеневыйлес1593526801:5:4823:6516:6515:1502:4786", -- [35]
			"!2174103Fruorin-Kazzak1593526810:4:4823:6515:1502:4786", -- [36]
			"!5174118Zaël-Blackrock1593526821:4:4823:1502:4786:6508", -- [37]
			"!B174132Cavdrood-Blackmoore1593531703:4:4823:1502:4786:6508", -- [38]
			"!B173944Ditche-Thrall1593531730:4:4823:6513:1502:4786", -- [39]
			"!2174170Smashipally-Sen'jin1593605920:8:4823:6578:6579:6474:6455:6515:1502:4786", -- [40]
			"!5172201Изилькин-СвежевательДуш1593607140:5:4823:6516:6515:1502:4786", -- [41]
			"!5172228Швпна1593612026:7:4823:6578:6579:6566:6515:1502:4786", -- [42]
			"!1174500Ничётакойвар-СвежевательДуш1593612034:4:4823:6515:1502:4786", -- [43]
			"!2174167Smashipally-Sen'jin1593613818:4:4823:1502:4786:6508", -- [44]
			"!1172187Ничётакойвар-СвежевательДуш1593613824:6:4823:6539:6578:6579:1502:4786", -- [45]
			"!3174155Girlizta-Kazzak1593624294:5:4824:6516:6513:1517:4786", -- [46]
			"!2173944Hermiz-Kazzak1593624301:5:4824:42:6515:1517:4786", -- [47]
			"!A174132Áckerman-Kazzak1593624323:4:4824:1517:4786:6511", -- [48]
			"!6174173Ahlsk-Kazzak1593625411:5:4824:6516:6513:1517:4786", -- [49]
			"!8160216Флинтомист1593629242:5:6534:6516:6515:1637:4786", -- [50]
			"!1159413Боротор-СвежевательДуш1593629251:6:6534:4802:6516:6515:1637:4786", -- [51]
			"!8169161Флинтомист1593638244:5:6536:6516:6515:1522:4786", -- [52]
		},
	},
	["ExCD2"] = {
		["default_userDuration"] = {
		},
		["gnGUIDs"] = {
			["Zarakaa-Kazzak"] = 250,
			["Надсат"] = 105,
			["Рэймил-Ясеневыйлес"] = 63,
			["Катенкьёкецу"] = 577,
			["Слаймсэнсэй"] = 267,
			["Кисакун"] = 102,
			["Шепотлиствы-СвежевательДуш"] = 258,
			["Альния-СвежевательДуш"] = 577,
			["Tsûkï-Archimonde"] = 71,
			["Чоты"] = 581,
			["Fruorin-Kazzak"] = 70,
			["Флинтомист"] = 63,
			["Святойтонни-СтражСмерти"] = 259,
			["Kiajin-Blackhand"] = 253,
			["Руинити"] = 253,
			["Дэвилекс-СвежевательДуш"] = 63,
			["Ramex-DarkmoonFaire"] = 253,
			["Сиуна"] = 258,
			["Yonna-Ysondre"] = 259,
			["Ishenmir-Hyjal"] = 253,
			["Иооса"] = 577,
			["Yurusé-Ragnaros"] = 72,
			["Yolotina-Silvermoon"] = 73,
			["Ahlsk-Kazzak"] = 252,
			["Keralìn-Zul'jin"] = 72,
			["Автомонк-Голдринн"] = 270,
			["Icebreakerxd-TarrenMill"] = 251,
			["Эмберлейн"] = 577,
			["Zàil-Kazzak"] = 65,
			["Апетитьки-СвежевательДуш"] = 258,
			["Destromáth-Blackrock"] = 259,
			["Трейлай-СвежевательДуш"] = 70,
			["Кукурузенька-ЧерныйШрам"] = 577,
			["Berrycuda-Kazzak"] = 256,
			["Шоур"] = 70,
			["Рикатун"] = 258,
			["Холворд-Дракономор"] = 250,
			["Illidury-Eredar"] = 577,
			["Faunus-TarrenMill"] = 73,
			["Grasy-Kazzak"] = 70,
			["Rainbowstone-TarrenMill"] = 581,
			["Севатарка"] = 269,
			["Ellie-Blackmoore"] = 267,
			["Dieskey-Kazzak"] = 63,
			["Итсафлейм"] = 267,
			["Xyda-Eredar"] = 577,
			["Аманарис-СвежевательДуш"] = 70,
			["Girlizta-Kazzak"] = 253,
			["Kastihell-Archimonde"] = 577,
			["Kappa-Aggra(Português)"] = 253,
			["Мохнатыйптиц-Гордунни"] = 577,
			["Jini-Draenor"] = 65,
			["Ихнего"] = 256,
			["Cavdrood-Blackmoore"] = 105,
			["Timberdrood-Kazzak"] = 102,
			["Летучиймышыч"] = 581,
			["Muxoll-Kazzak"] = 72,
			["Малютка-Борейскаятундра"] = 259,
			["Комабекфаер"] = 64,
			["Leló-Kazzak"] = 72,
			["Mojojojö-TarrenMill"] = 253,
			["Арсэя"] = 577,
			["Байрэкс"] = 63,
			["Takkeshia-Thrall"] = 264,
			["Каиоо"] = 73,
			["Nocoz-Blackrock"] = 253,
			["Калимистх"] = 259,
			["Грознар-Термоштепсель"] = 73,
			["Vinestrias-Chantséternels"] = 261,
			["Firiniel-ArgentDawn"] = 65,
			["Zynoss-Frostwolf"] = 103,
			["Hojojo-Hellfire"] = 269,
			["Немри"] = 105,
			["Швпна"] = 258,
			["Tchocknorris-Ysondre"] = 70,
			["Артушадх-СвежевательДуш"] = 577,
			["Lockize-Kazzak"] = 267,
			["Булкавар-Ясеневыйлес"] = 73,
			["Берслоу-СвежевательДуш"] = 66,
			["Клиндамист"] = 73,
			["Мемныйдх"] = 577,
			["Kedilya-LaCroisadeécarlate"] = 253,
			["Espérada-Hyjal"] = 65,
			["Roustougnouk-Drek'Thar"] = 70,
			["Limethiax-TwistingNether"] = 65,
			["Rabida-Blackhand"] = 259,
			["Sykås-Frostmane"] = 256,
			["Хорневаль"] = 268,
			["Maxusyo-TwistingNether"] = 267,
			["Ditche-Thrall"] = 102,
			["Сириусти"] = 71,
			["Velinne-BurningLegion"] = 267,
			["Errith-Wildhammer"] = 581,
			["Хэнкубийца-Ясеневыйлес"] = 72,
			["Leidjill-Hyjal"] = 267,
			["Койотпитерсн"] = 253,
			["Pubepoh-Stormscale"] = 72,
			["Нубнаггетсхх"] = 257,
			["Лысыймачо"] = 253,
			["Васявыручай"] = 73,
			["Калибор"] = 262,
			["Инитарио-Борейскаятундра"] = 63,
			["Ohsogoõd-TwistingNether"] = 256,
			["Shasya-Ragnaros"] = 259,
			["Вичка"] = 257,
			["Koksz-Wildhammer"] = 577,
			["Святи"] = 257,
			["Suktuke-Shadowsong"] = 577,
			["Mittsuky-Sanguino"] = 258,
			["Кирах-СвежевательДуш"] = 252,
			["Аменодиель-СвежевательДуш"] = 252,
			["Smiddyy-Blackmoore"] = 577,
			["Блэтнайт"] = 72,
			["Áckerman-Kazzak"] = 269,
			["Crauw-TarrenMill"] = 105,
			["Paytowin-Ragnaros"] = 253,
			["Кисапал"] = 65,
			["Dnight-Blackhand"] = 267,
			["Pðð-Thrall"] = 269,
			["Малганец"] = 252,
			["Resistance-Thrall"] = 102,
			["Alkhaldiol-Kazzak"] = 577,
			["Ваззапер"] = 105,
			["Opama-Kazzak"] = 267,
			["Nudelhôlz-Blackhand"] = 73,
			["Пушечка"] = 259,
			["Снжок-ВечнаяПесня"] = 259,
			["Yøøka-Hyjal"] = 262,
			["Дейхард-СвежевательДуш"] = 577,
			["Niksi-BurningLegion"] = 64,
			["Рауфхелп"] = 259,
			["Каминам"] = 253,
			["Reeyka-Kazzak"] = 251,
			["Фальмея-Ясеневыйлес"] = 63,
			["Gantzu-Blackhand"] = 269,
			["Клаож-СвежевательДуш"] = 257,
			["Акорат"] = 63,
			["Айкумена"] = 266,
			["Лиимф-СвежевательДуш"] = 253,
			["Саттинет-Ясеневыйлес"] = 105,
			["Кендифлоп"] = 65,
			["Sailybater-Hyjal"] = 577,
			["Magêd-Kazzak"] = 250,
			["Killerlman-Kazzak"] = 66,
			["Ничётакойвар-СвежевательДуш"] = 73,
			["Завурда-СвежевательДуш"] = 72,
			["Хетшесит"] = 260,
			["Aeternion-Draenor"] = 259,
			["Caerys-Quel'Thalas"] = 66,
			["Дэллориан"] = 581,
			["Deadlyshót-ZirkeldesCenarius"] = 267,
			["Rekka-Rashgarroth"] = 262,
			["Фэибл-Ясеневыйлес"] = 105,
			["Могучиймо"] = 70,
			["Хелзеферс"] = 102,
			["Lipïdès-Archimonde"] = 577,
			["Mârleya-Blackmoore"] = 102,
			["Dagulo-Thrall"] = 264,
			["Éowyn-Garrosh"] = 65,
			["Рубенатор"] = 70,
			["Сноха"] = 264,
			["Oms-Kel'Thuzad"] = 577,
			["Дамна-СвежевательДуш"] = 253,
			["Нармоморн-Ясеневыйлес"] = 267,
			["Соунсе-СвежевательДуш"] = 253,
			["Llordfaisall-Kazzak"] = 65,
			["Astramoon-TwistingNether"] = 102,
			["Арркон"] = 267,
			["Ксилиэль"] = 253,
			["Executional-Kazzak"] = 72,
			["Константилий-СвежевательДуш"] = 105,
			["Bnes-Kazzak"] = 253,
			["Amaïdhi-Hyjal"] = 102,
			["Биотешка"] = 269,
			["Олимоли"] = 257,
			["Tatânkâ-Blackmoore"] = 102,
			["Дёрггать-ВечнаяПесня"] = 251,
			["Pimmorc-Ragnaros"] = 262,
			["Сувала-СвежевательДуш"] = 265,
			["Шипвкд-СвежевательДуш"] = 63,
			["Сусанэ"] = 250,
			["Yägami-Archimonde"] = 65,
			["Стингрог"] = 260,
			["Макубай-Голдринн"] = 269,
			["Haunterr-Kazzak"] = 253,
			["Zaël-Blackrock"] = 256,
			["Хартквеик-СвежевательДуш"] = 256,
			["Caleb-Drak'thul"] = 269,
			["Андэм"] = 577,
			["Эвилняша"] = 577,
			["Хитлайн"] = 253,
			["Farmeruss-BurningLegion"] = 104,
			["Миркси-СвежевательДуш"] = 259,
			["Улькиори"] = 252,
			["Эголи"] = 262,
			["Elendhur-LosErrantes"] = 64,
			["Иллуинэль"] = 577,
			["Дельфар-СвежевательДуш"] = 104,
			["Utilizateur-Ysondre"] = 73,
			["Сышенджишоу-Корольлич"] = 262,
			["Изилькин-СвежевательДуш"] = 258,
			["Уролском-СвежевательДуш"] = 258,
			["Masasasha-Hyjal"] = 70,
			["Форсхант"] = 253,
			["Добренькая-СвежевательДуш"] = 105,
			["Patayya-Uldaman"] = 72,
			["Moraïne-Blackrock"] = 263,
			["Kosmodisk-Drak'thul"] = 250,
			["Валфрия"] = 256,
			["Eiwo-TarrenMill"] = 253,
			["Spicyclap-Kazzak"] = 72,
			["Нейона"] = 258,
			["Семеста"] = 256,
			["Smashipally-Sen'jin"] = 66,
			["Корвере-Ясеневыйлес"] = 253,
			["Kazooka-Blackhand"] = 253,
			["Лавапыщьпыщь"] = 262,
			["Керьли"] = 63,
			["Алпарон"] = 105,
			["Боротор-СвежевательДуш"] = 73,
			["Клотер"] = 258,
			["Heisseenberg-Kazzak"] = 577,
			["Obidaya-Cho'gall"] = 65,
			["Вавелина"] = 258,
			["Drnafes-Kazzak"] = 577,
			["Рамзанушка-СвежевательДуш"] = 267,
			["Dyrijan-Draenor"] = 70,
			["Гвиниверр-СвежевательДуш"] = 258,
			["Königsritter-Vek'lor"] = 250,
			["Самаэл-Дракономор"] = 577,
			["Johnweack-Hyjal"] = 72,
			["Сейнтпикси-СвежевательДуш"] = 70,
			["Ддц"] = 258,
			["Jomd-Kazzak"] = 253,
			["Амаёри"] = 258,
			["Холиспек-СвежевательДуш"] = 258,
			["Huskybeam-Bloodhoof"] = 577,
			["Balerionx-Kazzak"] = 577,
			["Bonanos-TarrenMill"] = 267,
			["Топдеточка"] = 65,
			["Шпэндик-ВечнаяПесня"] = 70,
			["Эйлинарра"] = 265,
			["Папущен"] = 577,
			["Tronícs-Blackhand"] = 267,
			["Якуса"] = 259,
			["Урамар"] = 71,
			["Дараен"] = 267,
			["Мирксимонк-СвежевательДуш"] = 270,
			["Azalen-Hyjal"] = 253,
			["Hermiz-Kazzak"] = 65,
			["Гассай"] = 267,
			["Pinkyswear-Ragnaros"] = 577,
			["Tayson-Zul'jin"] = 253,
			["Palltrisia-DefiasBrotherhood"] = 66,
			["Anore-Blackhand"] = 257,
			["Дайпак"] = 70,
			["Argoman-Agamaggan"] = 72,
			["Saruseq-BurningLegion"] = 66,
			["Peggann-Kazzak"] = 63,
			["Ðerkohld-Hyjal"] = 65,
			["Мргла"] = 63,
			["Акемии-Термоштепсель"] = 270,
			["Труплатыша"] = 267,
		},
		["NoRaid"] = true,
		["CDECol"] = {
		},
		["default_userCD"] = {
		},
		["userDB"] = {
		},
		["colSet"] = {
			{
				["enabled"] = true,
				["frameGeneral"] = true,
				["iconGray"] = true,
				["textGeneral"] = true,
				["methodsGeneral"] = true,
				["blacklistGeneral"] = true,
				["fontShadow"] = false,
				["iconGeneral"] = true,
				["fontOutline"] = true,
				["visibilityGeneral"] = true,
				["fontGeneral"] = true,
				["textureAnimation"] = true,
				["textureGeneral"] = true,
			}, -- [1]
			{
				["enabled"] = true,
				["frameGeneral"] = true,
				["iconGray"] = true,
				["textGeneral"] = true,
				["methodsGeneral"] = true,
				["blacklistGeneral"] = true,
				["fontShadow"] = false,
				["iconGeneral"] = true,
				["fontOutline"] = true,
				["visibilityGeneral"] = true,
				["fontGeneral"] = true,
				["textureAnimation"] = true,
				["textureGeneral"] = true,
			}, -- [2]
			{
				["enabled"] = true,
				["frameGeneral"] = true,
				["iconGray"] = true,
				["textGeneral"] = true,
				["methodsGeneral"] = true,
				["blacklistGeneral"] = true,
				["fontShadow"] = false,
				["iconGeneral"] = true,
				["fontOutline"] = true,
				["visibilityGeneral"] = true,
				["fontGeneral"] = true,
				["textureAnimation"] = true,
				["textureGeneral"] = true,
			}, -- [3]
			{
				["frameGeneral"] = true,
				["iconGray"] = true,
				["textGeneral"] = true,
				["methodsGeneral"] = true,
				["blacklistGeneral"] = true,
				["fontShadow"] = false,
				["iconGeneral"] = true,
				["fontOutline"] = true,
				["visibilityGeneral"] = true,
				["fontGeneral"] = true,
				["textureAnimation"] = true,
				["textureGeneral"] = true,
			}, -- [4]
			{
				["frameGeneral"] = true,
				["iconGray"] = true,
				["textGeneral"] = true,
				["methodsGeneral"] = true,
				["blacklistGeneral"] = true,
				["fontShadow"] = false,
				["iconGeneral"] = true,
				["fontOutline"] = true,
				["visibilityGeneral"] = true,
				["fontGeneral"] = true,
				["textureAnimation"] = true,
				["textureGeneral"] = true,
			}, -- [5]
			{
				["frameGeneral"] = true,
				["iconGray"] = true,
				["textGeneral"] = true,
				["methodsGeneral"] = true,
				["blacklistGeneral"] = true,
				["fontShadow"] = false,
				["iconGeneral"] = true,
				["fontOutline"] = true,
				["visibilityGeneral"] = true,
				["fontGeneral"] = true,
				["textureAnimation"] = true,
				["textureGeneral"] = true,
			}, -- [6]
			{
				["frameGeneral"] = true,
				["iconGray"] = true,
				["textGeneral"] = true,
				["methodsGeneral"] = true,
				["blacklistGeneral"] = true,
				["fontShadow"] = false,
				["iconGeneral"] = true,
				["fontOutline"] = true,
				["visibilityGeneral"] = true,
				["fontGeneral"] = true,
				["textureAnimation"] = true,
				["textureGeneral"] = true,
			}, -- [7]
			{
				["frameGeneral"] = true,
				["iconGray"] = true,
				["textGeneral"] = true,
				["methodsGeneral"] = true,
				["blacklistGeneral"] = true,
				["fontShadow"] = false,
				["iconGeneral"] = true,
				["fontOutline"] = true,
				["visibilityGeneral"] = true,
				["fontGeneral"] = true,
				["textureAnimation"] = true,
				["textureGeneral"] = true,
			}, -- [8]
			{
				["frameGeneral"] = true,
				["iconGray"] = true,
				["textGeneral"] = true,
				["methodsGeneral"] = true,
				["blacklistGeneral"] = true,
				["fontShadow"] = false,
				["iconGeneral"] = true,
				["fontOutline"] = true,
				["visibilityGeneral"] = true,
				["fontGeneral"] = true,
				["textureAnimation"] = true,
				["textureGeneral"] = true,
			}, -- [9]
			{
				["frameGeneral"] = true,
				["iconGray"] = true,
				["textGeneral"] = true,
				["methodsGeneral"] = true,
				["blacklistGeneral"] = true,
				["fontShadow"] = false,
				["iconGeneral"] = true,
				["fontOutline"] = true,
				["visibilityGeneral"] = true,
				["fontGeneral"] = true,
				["textureAnimation"] = true,
				["textureGeneral"] = true,
			}, -- [10]
			{
				["frameGeneral"] = true,
				["iconGray"] = true,
				["textGeneral"] = true,
				["methodsGeneral"] = true,
				["blacklistGeneral"] = true,
				["fontShadow"] = false,
				["iconGeneral"] = true,
				["fontOutline"] = true,
				["visibilityGeneral"] = true,
				["fontGeneral"] = true,
				["textureAnimation"] = true,
				["textureGeneral"] = true,
			}, -- [11]
		},
		["Priority"] = {
		},
		["CDE"] = {
		},
		["Save"] = {
		},
	},
	["Attendance"] = {
		["enabled"] = 2,
		["data"] = {
			{
				"IКиури", -- [1]
				"HДримина-СвежевательДуш", -- [2]
				"HЖалестина-СвежевательДуш", -- [3]
				"HФлинтомист", -- [4]
				"IХасуго", -- [5]
				"LЦарицафинска-СвежевательДуш", -- [6]
				"IСаргеррочка", -- [7]
				"JЛоктарща-СвежевательДуш", -- [8]
				"DТыхашка", -- [9]
				"LОслабление", -- [10]
				"LМохнатыйптиц-Гордунни", -- [11]
				"LДримскрима-СвежевательДуш", -- [12]
				"JМиластраза", -- [13]
				"JКожаныйрог", -- [14]
				"LЛетучиймышыч", -- [15]
				"LВентрихантер", -- [16]
				"DРилминка-СвежевательДуш", -- [17]
				"DСодакил", -- [18]
				"KБеаркат-СвежевательДуш", -- [19]
				"KКисточка-СвежевательДуш", -- [20]
				"JМалахитик-Гордунни", -- [21]
				"DДуширог", -- [22]
				[26] = "IJustsaucee-Kazzak",
				[27] = "LOdeen-Kazzak",
				[28] = "DProxeh-TwistingNether",
				["d"] = 15,
				["g"] = 25,
				["k"] = true,
				["eI"] = 2329,
				["eN"] = "Гневион",
				["t"] = 1592586545,
				["c"] = "Флинтомист-Ревущийфьорд",
			}, -- [1]
			{
				"BВенторум", -- [1]
				"JРэйвлорд", -- [2]
				"KАлпарон", -- [3]
				"HФлинтомист", -- [4]
				"CТеребоньтий", -- [5]
				"GFîtbull-TwistingNether", -- [6]
				"LПохильтеменя", -- [7]
				"HМргла", -- [8]
				"ASchlugo-TarrenMill", -- [9]
				"DКельдайна", -- [10]
				"CКойотпитерсн", -- [11]
				"HКерьли", -- [12]
				"ADranøsh-Mal'Ganis", -- [13]
				"CКаминам", -- [14]
				"DХетшесит", -- [15]
				"CCessedie-Blackhand", -- [16]
				"BЛайанель", -- [17]
				"BYokokourrama-Uldaman", -- [18]
				"IKiratino-Draenor", -- [19]
				"FАбдулл-СвежевательДуш", -- [20]
				["eN"] = "Леди Джайна Праудмур",
				["c"] = "Флинтомист-Ревущийфьорд",
				["t"] = 1592678633,
				["eI"] = 2281,
				["d"] = 16,
				["g"] = 20,
				["k"] = true,
			}, -- [2]
			{
				"ALaek-Thrall", -- [1]
				"JMaestró-Frostwhisper", -- [2]
				"DKihru-Frostwhisper", -- [3]
				"ECinui-Stormscale", -- [4]
				"LHellsfury-TarrenMill", -- [5]
				"AПашадикийвар-СтражСмерти", -- [6]
				"HЭнги-СвежевательДуш", -- [7]
				"AScorah-Hyjal", -- [8]
				"EСеместа", -- [9]
				"BAthenx-Draenor", -- [10]
				"BFischíí-Blackhand", -- [11]
				"GLonz-Ragnaros", -- [12]
				["c"] = "Семеста-Ревущийфьорд",
				["eN"] = "Н'Зот Заразитель",
				["t"] = 1592869459,
				["g"] = 14,
				[16] = "CRigidna-Kazzak",
				[17] = "FHavoc-Jaedenar",
				["k"] = true,
				["eI"] = 2344,
				["d"] = 15,
			}, -- [3]
			{
				"BВенторум", -- [1]
				"HКерьли", -- [2]
				"KАлпарон", -- [3]
				"CКаминам", -- [4]
				"KНадсат", -- [5]
				"AУрамар", -- [6]
				"IГассай", -- [7]
				"DКельдайна", -- [8]
				"LПапущен", -- [9]
				"DХетшесит", -- [10]
				"GФитоняшич", -- [11]
				"EСеместа", -- [12]
				"CКсилиэль", -- [13]
				"BБареон", -- [14]
				"LПохильтеменя", -- [15]
				"EБиотеша", -- [16]
				"CКойотпитерсн", -- [17]
				"LДэллориан", -- [18]
				"FКровоточка-Галакронд", -- [19]
				"HАкорат", -- [20]
				["eN"] = "Леди Джайна Праудмур",
				["c"] = "Семеста-Ревущийфьорд",
				["t"] = 1593017301,
				["eI"] = 2281,
				["d"] = 16,
				["g"] = 20,
				["k"] = true,
			}, -- [4]
			{
				"HDrumandbass-Kazzak", -- [1]
				"HThillaarion-Kazzak", -- [2]
				"GBarbu-Ragnaros", -- [3]
				"ISchmøkæbe-Draenor", -- [4]
				"BDarkenpala-Nemesis", -- [5]
				"JElvira-Dentarg", -- [6]
				"HXfreeze-TwistingNether", -- [7]
				"CMageet-TwistingNether", -- [8]
				"IWarhenn-Draenor", -- [9]
				"EJnrlæge-Draenor", -- [10]
				"FDimidk-Draenor", -- [11]
				"AKvrw-TwistingNether", -- [12]
				"LÐnz-Draenor", -- [13]
				"BКендифлоп", -- [14]
				"CÁshéx-Draenor", -- [15]
				"IPunklock-Archimonde", -- [16]
				"AFühre-Kazzak", -- [17]
				"LUseless-TwistingNether", -- [18]
				"KNaturenerd-Thrall", -- [19]
				"GSayrah-TarrenMill", -- [20]
				"KThäkona-TarrenMill", -- [21]
				["eI"] = 2329,
				["k"] = true,
				["t"] = 1593084094,
				["eN"] = "Гневион",
				["d"] = 15,
				["g"] = 21,
				["c"] = "Кендифлоп-Ревущийфьорд",
			}, -- [5]
			{
				"BВенторум", -- [1]
				"CКаминам", -- [2]
				"CЛысыймачо", -- [3]
				"FКровоточка-Галакронд", -- [4]
				"CКойотпитерсн", -- [5]
				"LПапущен", -- [6]
				"DХетшесит", -- [7]
				"AУрамар", -- [8]
				"FУлькиори", -- [9]
				"LПохильтеменя", -- [10]
				"EБиотеша", -- [11]
				"CТеребоньтий", -- [12]
				"KНадсат", -- [13]
				"IГассай", -- [14]
				"HКерьли", -- [15]
				"KАлпарон", -- [16]
				"GХилизгермани", -- [17]
				"BБареон", -- [18]
				"EСеместа", -- [19]
				"IАллориель", -- [20]
				["eN"] = "Темный инквизитор Занеш",
				["c"] = "Семеста-Ревущийфьорд",
				["t"] = 1593106773,
				["eI"] = 2328,
				["d"] = 16,
				["g"] = 20,
				["k"] = true,
			}, -- [6]
			{
				"HФлинтомист", -- [1]
				"DМалютка-Борейскаятундра", -- [2]
				"LIllidury-Eredar", -- [3]
				"BEspérada-Hyjal", -- [4]
				"AБулкавар-Ясеневыйлес", -- [5]
				"AYolotina-Silvermoon", -- [6]
				"EZaël-Blackrock", -- [7]
				"GYøøka-Hyjal", -- [8]
				"BFruorin-Kazzak", -- [9]
				"GMoraïne-Blackrock", -- [10]
				["eI"] = 2344,
				["c"] = "Флинтомист-Ревущийфьорд",
				["t"] = 1593526790,
				["eN"] = "Н'Зот Заразитель",
				["d"] = 15,
				["g"] = 10,
				["k"] = true,
			}, -- [7]
			{
				"ANudelhôlz-Blackhand", -- [1]
				"IDnight-Blackhand", -- [2]
				"EAnore-Blackhand", -- [3]
				"BÉowyn-Garrosh", -- [4]
				"ITronícs-Blackhand", -- [5]
				"KMârleya-Blackmoore", -- [6]
				"KDitche-Thrall", -- [7]
				"CHaunterr-Kazzak", -- [8]
				"JPðð-Thrall", -- [9]
				"KCavdrood-Blackmoore", -- [10]
				"LSailybater-Hyjal", -- [11]
				"CAzalen-Hyjal", -- [12]
				"HElendhur-LosErrantes", -- [13]
				"HФлинтомист", -- [14]
				"LHeisseenberg-Kazzak", -- [15]
				"CTayson-Zul'jin", -- [16]
				"BKillerlman-Kazzak", -- [17]
				"KФэибл-Ясеневыйлес", -- [18]
				"DDestromáth-Blackrock", -- [19]
				"IVelinne-BurningLegion", -- [20]
				"ILeidjill-Hyjal", -- [21]
				["k"] = true,
				["c"] = "Флинтомист-Ревущийфьорд",
				["d"] = 15,
				["eN"] = "Гневион",
				["t"] = 1593531059,
				["g"] = 21,
				["eI"] = 2329,
			}, -- [8]
			{
				"EХолиспек-СвежевательДуш", -- [1]
				"EДдц", -- [2]
				"EШепотлиствы-СвежевательДуш", -- [3]
				"EУролском-СвежевательДуш", -- [4]
				"EВавелина", -- [5]
				"EВичка", -- [6]
				"EКлотер", -- [7]
				"EНейона", -- [8]
				"EГвиниверр-СвежевательДуш", -- [9]
				"EАмаёри", -- [10]
				"EИзилькин-СвежевательДуш", -- [11]
				"EСеместа", -- [12]
				"EКлаож-СвежевательДуш", -- [13]
				"EРикатун", -- [14]
				"EСвяти", -- [15]
				"EАпетитьки-СвежевательДуш", -- [16]
				"LErrith-Wildhammer", -- [17]
				"EШвпна", -- [18]
				[26] = "EOhsogoõd-TwistingNether",
				[27] = "BSmashipally-Sen'jin",
				["eN"] = "Гневион",
				["d"] = 15,
				["g"] = 20,
				["k"] = true,
				["eI"] = 2329,
				["c"] = "Семеста-Ревущийфьорд",
				["t"] = 1593605907,
			}, -- [9]
			{
				"EХолиспек-СвежевательДуш", -- [1]
				"EДдц", -- [2]
				"EШепотлиствы-СвежевательДуш", -- [3]
				"EУролском-СвежевательДуш", -- [4]
				"EВавелина", -- [5]
				"EВичка", -- [6]
				"EКлотер", -- [7]
				"EНейона", -- [8]
				"EГвиниверр-СвежевательДуш", -- [9]
				"EАмаёри", -- [10]
				"EИзилькин-СвежевательДуш", -- [11]
				"EСеместа", -- [12]
				"EКлаож-СвежевательДуш", -- [13]
				"EРикатун", -- [14]
				"EСвяти", -- [15]
				"EАпетитьки-СвежевательДуш", -- [16]
				"LErrith-Wildhammer", -- [17]
				"EШвпна", -- [18]
				"AНичётакойвар-СвежевательДуш", -- [19]
				[26] = "EOhsogoõd-TwistingNether",
				[27] = "BSmashipally-Sen'jin",
				["eN"] = "Пророк Скитра",
				["d"] = 15,
				["g"] = 21,
				["k"] = true,
				["eI"] = 2334,
				["t"] = 1593607119,
				["c"] = "Семеста-Ревущийфьорд",
			}, -- [10]
			{
				"AУрамар", -- [1]
				"IГассай", -- [2]
				"CКсилиэль", -- [3]
				"KНадсат", -- [4]
				"IЭйлинарра", -- [5]
				"JБиотешка", -- [6]
				"HМргла", -- [7]
				"LПапущен", -- [8]
				"CЛысыймачо", -- [9]
				"HКерьли", -- [10]
				"DХетшесит", -- [11]
				"LДэллориан", -- [12]
				"FСусанэ", -- [13]
				"LМемныйдх", -- [14]
				"CКаминам", -- [15]
				"KАлпарон", -- [16]
				"EСеместа", -- [17]
				"HАкорат", -- [18]
				"CКойотпитерсн", -- [19]
				"FУлькиори", -- [20]
				["c"] = "Семеста-Ревущийфьорд",
				["k"] = true,
				["d"] = 16,
				["eI"] = 2281,
				["t"] = 1593622788,
				["g"] = 20,
				["eN"] = "Леди Джайна Праудмур",
			}, -- [11]
			{
				"FZarakaa-Kazzak", -- [1]
				"JÁckerman-Kazzak", -- [2]
				"LDrnafes-Kazzak", -- [3]
				"LBalerionx-Kazzak", -- [4]
				"FReeyka-Kazzak", -- [5]
				"LAlkhaldiol-Kazzak", -- [6]
				"AExecutional-Kazzak", -- [7]
				"CJomd-Kazzak", -- [8]
				"ASpicyclap-Kazzak", -- [9]
				"CGirlizta-Kazzak", -- [10]
				"KTimberdrood-Kazzak", -- [11]
				"BLlordfaisall-Kazzak", -- [12]
				"GDagulo-Thrall", -- [13]
				"IBonanos-TarrenMill", -- [14]
				"BHermiz-Kazzak", -- [15]
				"IOpama-Kazzak", -- [16]
				"FMagêd-Kazzak", -- [17]
				"FAhlsk-Kazzak", -- [18]
				"EСеместа", -- [19]
				"CKappa-Aggra(Português)", -- [20]
				["c"] = "Семеста-Ревущийфьорд",
				["k"] = true,
				["d"] = 16,
				["eI"] = 2327,
				["t"] = 1593624287,
				["g"] = 20,
				["eN"] = "Маут",
			}, -- [12]
		},
		["alts"] = {
		},
	},
	["InspectViewer"] = {
		["ColorizeLowIlvl685"] = false,
		["ColorizeNoEnch"] = true,
		["ColorizeNoGems"] = true,
		["ColorizeLowIlvl"] = true,
		["ColorizeNoTopEnchGems"] = false,
		["ColorizeNoValorUpgrade"] = false,
	},
	["Timers"] = {
		["specTimes"] = {
			[62] = 10,
			[63] = 10,
			[250] = 10,
			[251] = 10,
			[64] = 10,
			[253] = 10,
			[65] = 10,
			[255] = 10,
			[66] = 10,
			[257] = 10,
			[258] = 10,
			[259] = 10,
			[260] = 10,
			[261] = 25,
			[262] = 16,
			[263] = 10,
			[264] = 10,
			[265] = 22,
			[266] = 10,
			[267] = 10,
			[268] = 10,
			[269] = 10,
			[270] = 10,
			[70] = 10,
			[102] = 10,
			[71] = 10,
			[103] = 10,
			[72] = 10,
			[104] = 10,
			[73] = 10,
			[581] = 10,
			[105] = 10,
			[577] = 10,
			[256] = 10,
			[254] = 10,
			[252] = 10,
		},
		["Type"] = 2,
		["Strata"] = "HIGH",
		["timeToKillAnalyze"] = 15,
	},
	["Addon"] = {
		["Version"] = 4170,
		["Scale"] = 1.01,
		["PreVersion"] = 4170,
		["IconMiniMapTop"] = -12.14427730767996,
		["Timer"] = 0.1,
		["IconMiniMapLeft"] = 79.07285582723169,
	},
	["WhoPulled"] = {
	},
	["BossWatcher"] = {
		["optionsDamageGraph"] = true,
		["fightsNum"] = 2,
		["optionsPositionsDist"] = true,
		["optionsHealingGraph"] = true,
		["trackingDamageSpells"] = {
		},
	},
	["Profiles"] = {
	},
	["Profile"] = "default",
	["LootLink"] = {
	},
	["Note"] = {
		["BlackNames"] = {
		},
		["Strata"] = "HIGH",
		["LastUpdateName"] = "Арсэя-Ревущийфьорд",
		["AutoLoad"] = {
		},
		["LastUpdateTime"] = 1593612785,
		["Width"] = 199.9999084472656,
		["BlackLastUpdateName"] = {
		},
		["FontSize"] = 12,
		["OnlyPromoted"] = true,
		["BlackLastUpdateTime"] = {
		},
		["Height"] = 100.0000686645508,
		["Black"] = {
			"", -- [1]
			"", -- [2]
			"", -- [3]
			"", -- [4]
		},
		["Text1"] = "{звезда} 1ый Портал : 1-2 Группа {звезда}\n{ромб}  2ой портал: 3-4-5  Группа   {ромб}\n||cfffefefeКлаож||r  на верху",
		["OptionsFormatting"] = true,
	},
	["RaidCheck"] = {
		["ReadyCheckFrameOnlyRL"] = true,
		["BuffsCheck"] = true,
		["ReadyCheckFrame"] = true,
		["ReadyCheckFrameTimerFade"] = 4,
		["FlaskExp"] = 1,
		["ReadyCheckLeft"] = 1574.811767578125,
		["ReadyCheckTop"] = 352.8672790527344,
	},
	["Logging"] = {
	},
	["MarksBar"] = {
		["pulltimer"] = 10,
		["pulltimer_right"] = 10,
		["Show"] = {
			true, -- [1]
			true, -- [2]
			true, -- [3]
			true, -- [4]
			true, -- [5]
		},
		["Strata"] = "HIGH",
	},
	["VisNote"] = {
		["data"] = {
		},
		["sync_data"] = {
		},
	},
	["InviteTool"] = {
		["Words"] = "инв inv byd штм 123",
		["InvByChat"] = true,
		["RaidDiff"] = 16,
		["PromoteRank"] = 2,
		["Ranks"] = {
			true, -- [1]
		},
		["LootThreshold"] = 2,
		["MasterLooters"] = "",
		["LootMethod"] = "group",
		["PromoteNames"] = "",
		["OnlyGuild"] = true,
		["Rank"] = 1,
	},
}
