
flyPlateBuffsDB = {
	["version"] = 2,
	["profileKeys"] = {
		["Ваззапер - Ревущий фьорд"] = "Default",
		["Мушкетерх - Ревущий фьорд"] = "Default",
		["Ваззапер - Черный Шрам"] = "Default",
		["Плагмейстер - Черный Шрам"] = "Default",
		["Кендифлоп - Ревущий фьорд"] = "Default",
		["Калимистх - Ревущий фьорд"] = "Default",
		["Мушкетер - Черный Шрам"] = "Default",
		["Кварик - Черный Шрам"] = "Default",
		["Итсафлейм - Черный Шрам"] = "Default",
		["Комабекфаер - Черный Шрам"] = "Default",
		["Жрумс - Черный Шрам"] = "Default",
		["Фасрок - Черный Шрам"] = "Default",
		["Флинтомист - Ревущий фьорд"] = "Default",
		["Клиндамист - Ревущий фьорд"] = "Клиндамист - Ревущий фьорд",
		["Соваестдетей - Ревущий фьорд"] = "Default",
		["Итсафлеймх - Черный Шрам"] = "Default",
		["Хидрамист - Ревущий фьорд"] = "Default",
	},
	["profiles"] = {
		["Default"] = {
			["durationSize"] = 11,
			["baseHeight"] = 26,
		},
		["Клиндамист - Ревущий фьорд"] = {
		},
	},
}
