
GladiusExDB = {
	["namespaces"] = {
		["party_CastBar"] = {
		},
		["Highlight"] = {
		},
		["LibDualSpec-1.0"] = {
		},
		["party_Alerts"] = {
		},
		["party_HealthBar"] = {
		},
		["party_ClassIcon"] = {
		},
		["party_Highlight"] = {
		},
		["party_DRTracker"] = {
		},
		["DRTracker"] = {
		},
		["party_PowerBar"] = {
		},
		["SkillHistory"] = {
		},
		["party_TargetBar"] = {
		},
		["Cooldowns"] = {
		},
		["arena"] = {
			["profiles"] = {
				["Флинтомист - Ревущий фьорд"] = {
					["y"] = {
						["anchor_arena"] = 416.2000549243021,
						["arena3"] = 372.9750565097857,
						["arena2"] = 432.1249749944764,
						["arena1"] = 491.2749728248673,
					},
					["x"] = {
						["anchor_arena"] = 914.0555633964686,
						["arena3"] = 941.3555623951106,
						["arena2"] = 941.3555623951106,
						["arena1"] = 941.3555623951106,
					},
				},
				["Кендифлоп - Ревущий фьорд"] = {
					["y"] = {
						["anchor_arena"] = 406.9556460836975,
						["arena2"] = 422.8806058267219,
						["arena3"] = 363.7306873420312,
						["arena1"] = 482.0306036571128,
					},
					["x"] = {
						["anchor_arena"] = 926.144436244067,
						["arena2"] = 953.444435242709,
						["arena3"] = 953.444435242709,
						["arena1"] = 953.444435242709,
					},
				},
				["Калимистх - Ревущий фьорд"] = {
					["y"] = {
						["anchor_arena"] = 411.2223024213381,
						["arena2"] = 427.1473018372126,
						["arena3"] = 367.9973040068217,
						["arena1"] = 486.2972203219033,
					},
					["x"] = {
						["anchor_arena"] = 897.7002722483303,
						["arena2"] = 925.0002712469723,
						["arena3"] = 925.0002712469723,
						["arena1"] = 925.0002712469723,
					},
				},
				["Ищублима - Гордунни"] = {
					["y"] = {
						["anchor_arena"] = 421.1776884087158,
						["arena2"] = 437.10260847889,
						["arena3"] = 377.9526899941993,
						["arena1"] = 496.252606309281,
					},
					["x"] = {
						["anchor_arena"] = 975.9222786565078,
						["arena2"] = 1003.22227765515,
						["arena3"] = 1003.22227765515,
						["arena1"] = 1003.22227765515,
					},
				},
				["Хидрамист - Ревущий фьорд"] = {
					["y"] = {
						["anchor_arena"] = 411.9333589138114,
						["arena3"] = 368.7083604992949,
						["arena2"] = 427.8583186568358,
						["arena1"] = 487.0082768143766,
					},
					["x"] = {
						["anchor_arena"] = 877.0779280340503,
						["arena3"] = 904.3779270326922,
						["arena2"] = 904.3779270326922,
						["arena1"] = 904.3779270326922,
					},
				},
			},
		},
		["Auras"] = {
		},
		["CastBar"] = {
		},
		["party"] = {
			["profiles"] = {
				["Флинтомист - Ревущий фьорд"] = {
					["y"] = {
						["anchor_party"] = 418.3333434202723,
						["player"] = 493.4083009936876,
						["party1"] = 434.2583031632967,
						["party2"] = 375.1083450057558,
					},
					["x"] = {
						["anchor_party"] = 267.3444268393723,
						["player"] = 321.9444843459314,
						["party1"] = 321.9444843459314,
						["party2"] = 321.9444843459314,
					},
				},
				["Кендифлоп - Ревущий фьорд"] = {
					["y"] = {
						["anchor_party"] = 355.0444755024364,
						["player"] = 430.1194330758517,
						["party2"] = 311.8195167607701,
						["party1"] = 370.9694749183109,
					},
					["x"] = {
						["anchor_party"] = 282.2777438575395,
						["player"] = 336.8778013640986,
						["party2"] = 336.8778013640986,
						["party1"] = 336.8778013640986,
					},
				},
				["Калимистх - Ревущий фьорд"] = {
					["y"] = {
						["anchor_party"] = 400.5555425586863,
						["player"] = 475.6304604592515,
						["party1"] = 416.4805023017107,
						["party2"] = 357.3305441441698,
					},
					["x"] = {
						["anchor_party"] = 370.4555528180208,
						["player"] = 425.055630161005,
						["party1"] = 425.055630161005,
						["party2"] = 425.055630161005,
					},
				},
				["Ищублима - Гордунни"] = {
					["y"] = {
						["anchor_party"] = 423.3110959232363,
						["player"] = 498.3860138238015,
						["party2"] = 380.0861371815699,
						["party1"] = 439.2360556662607,
					},
					["x"] = {
						["anchor_party"] = 171.3444410417833,
						["player"] = 225.9444787119173,
						["party2"] = 225.9444787119173,
						["party1"] = 225.9444787119173,
					},
				},
				["Хидрамист - Ревущий фьорд"] = {
					["y"] = {
						["anchor_party"] = 399.844486066213,
						["player"] = 474.9194039667782,
						["party1"] = 415.7694854820875,
						["party2"] = 356.6194876516966,
					},
					["x"] = {
						["anchor_party"] = 339.8779813077636,
						["player"] = 394.4780983235978,
						["party1"] = 394.4780983235978,
						["party2"] = 394.4780983235978,
					},
				},
			},
		},
		["party_SkillHistory"] = {
		},
		["PowerBar"] = {
		},
		["Interrupts"] = {
		},
		["party_Announcements"] = {
		},
		["HealthBar"] = {
		},
		["Clicks"] = {
		},
		["Tags"] = {
		},
		["party_Cooldowns"] = {
		},
		["party_Clicks"] = {
		},
		["party_Auras"] = {
		},
		["party_Interrupts"] = {
		},
		["party_Tags"] = {
		},
		["TargetBar"] = {
		},
		["Alerts"] = {
		},
		["Announcements"] = {
		},
		["PetBar"] = {
		},
		["party_PetBar"] = {
		},
		["ClassIcon"] = {
		},
	},
	["profileKeys"] = {
		["Флинтомист - Ревущий фьорд"] = "Флинтомист - Ревущий фьорд",
		["Кендифлоп - Ревущий фьорд"] = "Кендифлоп - Ревущий фьорд",
		["Калимистх - Ревущий фьорд"] = "Калимистх - Ревущий фьорд",
		["Хидрамист - Ревущий фьорд"] = "Хидрамист - Ревущий фьорд",
		["Ищублима - Гордунни"] = "Ищублима - Гордунни",
		["Фасрок - Черный Шрам"] = "Фасрок - Черный Шрам",
	},
	["profiles"] = {
		["Флинтомист - Ревущий фьорд"] = {
			["showParty"] = false,
		},
		["Кендифлоп - Ревущий фьорд"] = {
			["locked"] = true,
			["showParty"] = false,
		},
		["Калимистх - Ревущий фьорд"] = {
			["showParty"] = false,
		},
		["Хидрамист - Ревущий фьорд"] = {
			["showParty"] = false,
		},
		["Ищублима - Гордунни"] = {
		},
		["Фасрок - Черный Шрам"] = {
		},
	},
}
