
HandyNotesDB = {
	["profileKeys"] = {
		["Семеста - Ревущий фьорд"] = "Семеста - Ревущий фьорд",
		["Флинтомист - Ревущий фьорд"] = "Флинтомист - Ревущий фьорд",
	},
	["profiles"] = {
		["Семеста - Ревущий фьорд"] = {
		},
		["Флинтомист - Ревущий фьорд"] = {
		},
	},
}
HandyNotes_HandyNotesDB = {
	["profileKeys"] = {
		["Семеста - Ревущий фьорд"] = "Семеста - Ревущий фьорд",
		["Флинтомист - Ревущий фьорд"] = "Флинтомист - Ревущий фьорд",
	},
	["profiles"] = {
		["Семеста - Ревущий фьорд"] = {
		},
		["Флинтомист - Ревущий фьорд"] = {
		},
	},
}
