
HandyNotesDB = {
	["profileKeys"] = {
		["Ваззапер - Ревущий фьорд"] = "Ваззапер - Ревущий фьорд",
		["Семеста - Ревущий фьорд"] = "Семеста - Ревущий фьорд",
		["Мушкетерх - Ревущий фьорд"] = "Мушкетерх - Ревущий фьорд",
		["Валфрия - Гордунни"] = "Валфрия - Гордунни",
		["Ваззапер - Черный Шрам"] = "Ваззапер - Черный Шрам",
		["Итсафлейм - Черный Шрам"] = "Итсафлейм - Черный Шрам",
		["Флинтомист - Ревущий фьорд"] = "Флинтомист - Ревущий фьорд",
		["Кендифлоп - Ревущий фьорд"] = "Кендифлоп - Ревущий фьорд",
		["Калимистх - Ревущий фьорд"] = "Калимистх - Ревущий фьорд",
		["Сноха - Ревущий фьорд"] = "Сноха - Ревущий фьорд",
		["Клиндамист - Ревущий фьорд"] = "Клиндамист - Ревущий фьорд",
		["Валфрия - Ревущий фьорд"] = "Валфрия - Ревущий фьорд",
		["Комабекфаер - Черный Шрам"] = "Комабекфаер - Черный Шрам",
	},
	["profiles"] = {
		["Ваззапер - Ревущий фьорд"] = {
		},
		["Семеста - Ревущий фьорд"] = {
		},
		["Мушкетерх - Ревущий фьорд"] = {
		},
		["Валфрия - Гордунни"] = {
		},
		["Ваззапер - Черный Шрам"] = {
		},
		["Итсафлейм - Черный Шрам"] = {
		},
		["Флинтомист - Ревущий фьорд"] = {
		},
		["Кендифлоп - Ревущий фьорд"] = {
		},
		["Калимистх - Ревущий фьорд"] = {
		},
		["Сноха - Ревущий фьорд"] = {
		},
		["Клиндамист - Ревущий фьорд"] = {
		},
		["Валфрия - Ревущий фьорд"] = {
		},
		["Комабекфаер - Черный Шрам"] = {
		},
	},
}
HandyNotes_HandyNotesDB = {
	["profileKeys"] = {
		["Ваззапер - Ревущий фьорд"] = "Ваззапер - Ревущий фьорд",
		["Семеста - Ревущий фьорд"] = "Семеста - Ревущий фьорд",
		["Мушкетерх - Ревущий фьорд"] = "Мушкетерх - Ревущий фьорд",
		["Валфрия - Гордунни"] = "Валфрия - Гордунни",
		["Ваззапер - Черный Шрам"] = "Ваззапер - Черный Шрам",
		["Итсафлейм - Черный Шрам"] = "Итсафлейм - Черный Шрам",
		["Флинтомист - Ревущий фьорд"] = "Флинтомист - Ревущий фьорд",
		["Кендифлоп - Ревущий фьорд"] = "Кендифлоп - Ревущий фьорд",
		["Калимистх - Ревущий фьорд"] = "Калимистх - Ревущий фьорд",
		["Сноха - Ревущий фьорд"] = "Сноха - Ревущий фьорд",
		["Клиндамист - Ревущий фьорд"] = "Клиндамист - Ревущий фьорд",
		["Валфрия - Ревущий фьорд"] = "Валфрия - Ревущий фьорд",
		["Комабекфаер - Черный Шрам"] = "Комабекфаер - Черный Шрам",
	},
	["profiles"] = {
		["Ваззапер - Ревущий фьорд"] = {
		},
		["Семеста - Ревущий фьорд"] = {
		},
		["Мушкетерх - Ревущий фьорд"] = {
		},
		["Валфрия - Гордунни"] = {
		},
		["Ваззапер - Черный Шрам"] = {
		},
		["Итсафлейм - Черный Шрам"] = {
		},
		["Флинтомист - Ревущий фьорд"] = {
		},
		["Кендифлоп - Ревущий фьорд"] = {
		},
		["Калимистх - Ревущий фьорд"] = {
		},
		["Сноха - Ревущий фьорд"] = {
		},
		["Клиндамист - Ревущий фьорд"] = {
		},
		["Валфрия - Ревущий фьорд"] = {
		},
		["Комабекфаер - Черный Шрам"] = {
		},
	},
}
