
HandyNotesDB = {
	["profileKeys"] = {
		["Ваззапер - Ревущий фьорд"] = "Ваззапер - Ревущий фьорд",
		["Флинтомист - Ревущий фьорд"] = "Флинтомист - Ревущий фьорд",
		["Кендифлоп - Ревущий фьорд"] = "Кендифлоп - Ревущий фьорд",
		["Калимистх - Ревущий фьорд"] = "Калимистх - Ревущий фьорд",
		["Соваестдетей - Ревущий фьорд"] = "Соваестдетей - Ревущий фьорд",
		["Сноха - Ревущий фьорд"] = "Сноха - Ревущий фьорд",
		["Хидрамист - Ревущий фьорд"] = "Хидрамист - Ревущий фьорд",
	},
	["profiles"] = {
		["Ваззапер - Ревущий фьорд"] = {
		},
		["Флинтомист - Ревущий фьорд"] = {
		},
		["Кендифлоп - Ревущий фьорд"] = {
		},
		["Калимистх - Ревущий фьорд"] = {
		},
		["Соваестдетей - Ревущий фьорд"] = {
		},
		["Сноха - Ревущий фьорд"] = {
		},
		["Хидрамист - Ревущий фьорд"] = {
		},
	},
}
HandyNotes_HandyNotesDB = {
	["profileKeys"] = {
		["Ваззапер - Ревущий фьорд"] = "Ваззапер - Ревущий фьорд",
		["Флинтомист - Ревущий фьорд"] = "Флинтомист - Ревущий фьорд",
		["Кендифлоп - Ревущий фьорд"] = "Кендифлоп - Ревущий фьорд",
		["Калимистх - Ревущий фьорд"] = "Калимистх - Ревущий фьорд",
		["Соваестдетей - Ревущий фьорд"] = "Соваестдетей - Ревущий фьорд",
		["Сноха - Ревущий фьорд"] = "Сноха - Ревущий фьорд",
		["Хидрамист - Ревущий фьорд"] = "Хидрамист - Ревущий фьорд",
	},
	["profiles"] = {
		["Ваззапер - Ревущий фьорд"] = {
		},
		["Флинтомист - Ревущий фьорд"] = {
		},
		["Кендифлоп - Ревущий фьорд"] = {
		},
		["Калимистх - Ревущий фьорд"] = {
		},
		["Соваестдетей - Ревущий фьорд"] = {
		},
		["Сноха - Ревущий фьорд"] = {
		},
		["Хидрамист - Ревущий фьорд"] = {
		},
	},
}
