
HandyNotes_VisionsOfNZothDB = {
	["profileKeys"] = {
		["Ваззапер - Ревущий фьорд"] = "Default",
		["Семеста - Ревущий фьорд"] = "Default",
		["Мушкетерх - Ревущий фьорд"] = "Default",
		["Валфрия - Гордунни"] = "Default",
		["Ваззапер - Черный Шрам"] = "Default",
		["Итсафлейм - Черный Шрам"] = "Default",
		["Флинтомист - Ревущий фьорд"] = "Default",
		["Кендифлоп - Ревущий фьорд"] = "Default",
		["Калимистх - Ревущий фьорд"] = "Default",
		["Сноха - Ревущий фьорд"] = "Default",
		["Клиндамист - Ревущий фьорд"] = "Default",
		["Валфрия - Ревущий фьорд"] = "Default",
		["Комабекфаер - Черный Шрам"] = "Default",
	},
	["profiles"] = {
		["Default"] = {
		},
	},
}
