
OmniCCDB = {
	["global"] = {
		["addonVersion"] = "8.3.5",
		["dbVersion"] = 5,
	},
	["profileKeys"] = {
		["Ваззапер - Ревущий фьорд"] = "По умолчанию",
		["Мушкетерх - Ревущий фьорд"] = "По умолчанию",
		["Флинтомист - Ревущий фьорд"] = "По умолчанию",
		["Кендифлоп - Ревущий фьорд"] = "По умолчанию",
		["Калимистх - Ревущий фьорд"] = "По умолчанию",
		["Сноха - Ревущий фьорд"] = "По умолчанию",
		["Клиндамист - Ревущий фьорд"] = "По умолчанию",
		["Соваестдетей - Ревущий фьорд"] = "По умолчанию",
		["Хидрамист - Ревущий фьорд"] = "По умолчанию",
	},
	["profiles"] = {
		["По умолчанию"] = {
			["themes"] = {
				["По умолчанию"] = {
					["textStyles"] = {
						["seconds"] = {
						},
						["soon"] = {
						},
						["minutes"] = {
						},
					},
				},
			},
		},
	},
}
OmniCC4Config = nil
