
Quartz3DB = {
	["namespaces"] = {
		["Swing"] = {
		},
		["Buff"] = {
			["profiles"] = {
				["Default"] = {
					["buffnametext"] = false,
					["timesort"] = false,
					["bufftimetext"] = false,
				},
			},
		},
		["Interrupt"] = {
		},
		["Flight"] = {
		},
		["Pet"] = {
			["profiles"] = {
				["Default"] = {
					["x"] = 418.9998168945313,
					["y"] = 394.0000915527344,
				},
				["Клиндамист - Ревущий фьорд"] = {
					["x"] = 860,
				},
				["Ревущий фьорд"] = {
					["x"] = 860,
				},
				["PRIEST"] = {
					["x"] = 860,
				},
			},
		},
		["Player"] = {
			["profiles"] = {
				["Default"] = {
					["h"] = 39,
					["w"] = 180,
					["y"] = 337,
					["border"] = "Blizzard Achievement Wood",
					["x"] = 669.9999389648438,
					["timefontsize"] = 16,
					["texture"] = "Details D'ictum",
				},
				["Клиндамист - Ревущий фьорд"] = {
					["x"] = 835,
				},
				["Ревущий фьорд"] = {
					["x"] = 835,
				},
				["PRIEST"] = {
					["x"] = 835,
				},
			},
		},
		["EnemyCasts"] = {
		},
		["GCD"] = {
		},
		["Focus"] = {
			["profiles"] = {
				["Default"] = {
					["h"] = 45,
					["w"] = 680,
					["y"] = 741.0000610351562,
					["x"] = 672.9996337890625,
					["hideblizz"] = false,
				},
				["Клиндамист - Ревущий фьорд"] = {
					["x"] = 860,
				},
				["Ревущий фьорд"] = {
					["x"] = 860,
				},
				["PRIEST"] = {
					["x"] = 860,
				},
			},
		},
		["Target"] = {
			["profiles"] = {
				["Default"] = {
					["h"] = 34,
					["w"] = 180,
					["y"] = 425.9999389648438,
					["x"] = 1073.000122070313,
				},
				["Клиндамист - Ревущий фьорд"] = {
					["x"] = 860,
				},
				["Ревущий фьорд"] = {
					["x"] = 860,
				},
				["PRIEST"] = {
					["x"] = 860,
				},
			},
		},
		["Mirror"] = {
		},
		["Range"] = {
		},
		["Latency"] = {
		},
	},
	["profileKeys"] = {
		["Ваззапер - Ревущий фьорд"] = "Default",
		["Флинтомист - Ревущий фьорд"] = "Default",
		["Кендифлоп - Ревущий фьорд"] = "Default",
		["Мушкетерх - Ревущий фьорд"] = "Default",
		["Калимистх - Ревущий фьорд"] = "Default",
		["Соваестдетей - Ревущий фьорд"] = "Default",
		["Клиндамист - Ревущий фьорд"] = "Default",
		["Хидрамист - Ревущий фьорд"] = "Default",
	},
	["profiles"] = {
		["Default"] = {
			["modules"] = {
				["Buff"] = false,
			},
		},
		["Клиндамист - Ревущий фьорд"] = {
		},
		["Ревущий фьорд"] = {
		},
		["PRIEST"] = {
		},
	},
}
