
Quartz3DB = {
	["namespaces"] = {
		["Swing"] = {
		},
		["Buff"] = {
			["profiles"] = {
				["Default"] = {
					["buffnametext"] = false,
					["timesort"] = false,
					["bufftimetext"] = false,
				},
			},
		},
		["Interrupt"] = {
		},
		["Flight"] = {
		},
		["Pet"] = {
			["profiles"] = {
				["Default"] = {
					["x"] = 844.5729370117188,
					["y"] = 205.8287353515625,
				},
				["Клиндамист - Ревущий фьорд"] = {
					["x"] = 860,
				},
				["Ревущий фьорд"] = {
					["x"] = 860,
				},
				["PRIEST"] = {
					["x"] = 860,
				},
			},
		},
		["Player"] = {
			["profiles"] = {
				["Default"] = {
					["h"] = 40,
					["w"] = 180,
					["y"] = 401.5454406738281,
					["border"] = "Blizzard Achievement Wood",
					["x"] = 680.9402465820312,
					["timefontsize"] = 20,
					["texture"] = "Details D'ictum",
				},
				["Клиндамист - Ревущий фьорд"] = {
					["x"] = 835,
				},
				["Ревущий фьорд"] = {
					["x"] = 835,
				},
				["PRIEST"] = {
					["x"] = 835,
				},
			},
		},
		["EnemyCasts"] = {
		},
		["GCD"] = {
		},
		["Focus"] = {
			["profiles"] = {
				["Default"] = {
					["h"] = 45,
					["w"] = 195,
					["y"] = 727.8718872070312,
					["x"] = 457.478271484375,
					["hideblizz"] = false,
				},
				["Клиндамист - Ревущий фьорд"] = {
					["x"] = 860,
				},
				["Ревущий фьорд"] = {
					["x"] = 860,
				},
				["PRIEST"] = {
					["x"] = 860,
				},
			},
		},
		["Target"] = {
			["profiles"] = {
				["Default"] = {
					["h"] = 40,
					["w"] = 180,
					["y"] = 400.8373107910156,
					["border"] = "Blizzard Achievement Wood",
					["x"] = 1242.9912109375,
					["noInterruptChangeBorder"] = true,
					["timefontsize"] = 20,
				},
				["Клиндамист - Ревущий фьорд"] = {
					["x"] = 860,
				},
				["Ревущий фьорд"] = {
					["x"] = 860,
				},
				["PRIEST"] = {
					["x"] = 860,
				},
			},
		},
		["Mirror"] = {
		},
		["Range"] = {
		},
		["Latency"] = {
		},
	},
	["profileKeys"] = {
		["Ваззапер - Ревущий фьорд"] = "Default",
		["Мушкетерх - Ревущий фьорд"] = "Default",
		["Флинтомист - Ревущий фьорд"] = "Default",
		["Кендифлоп - Ревущий фьорд"] = "Default",
		["Калимистх - Ревущий фьорд"] = "Default",
		["Сноха - Ревущий фьорд"] = "Default",
		["Клиндамист - Ревущий фьорд"] = "Default",
		["Соваестдетей - Ревущий фьорд"] = "Default",
		["Хидрамист - Ревущий фьорд"] = "Default",
	},
	["profiles"] = {
		["Default"] = {
			["modules"] = {
				["Buff"] = false,
			},
		},
		["Клиндамист - Ревущий фьорд"] = {
		},
		["Ревущий фьорд"] = {
		},
		["PRIEST"] = {
		},
	},
}
