
TomTomDB = {
	["profileKeys"] = {
		["Ваззапер - Ревущий фьорд"] = "Default",
		["Мушкетерх - Ревущий фьорд"] = "Default",
		["Ваззапер - Черный Шрам"] = "Default",
		["Плагмейстер - Черный Шрам"] = "Default",
		["Кендифлоп - Ревущий фьорд"] = "Default",
		["Калимистх - Ревущий фьорд"] = "Default",
		["Мушкетер - Черный Шрам"] = "Default",
		["Кварик - Черный Шрам"] = "Default",
		["Итсафлейм - Черный Шрам"] = "Default",
		["Комабекфаер - Черный Шрам"] = "Default",
		["Жрумс - Черный Шрам"] = "Default",
		["Фасрок - Черный Шрам"] = "Default",
		["Флинтомист - Ревущий фьорд"] = "Default",
		["Соваестдетей - Ревущий фьорд"] = "Default",
		["Клиндамист - Ревущий фьорд"] = "Default",
		["Итсафлеймх - Черный Шрам"] = "Default",
		["Хидрамист - Ревущий фьорд"] = "Default",
	},
	["profiles"] = {
		["Default"] = {
			["arrow"] = {
				["position"] = {
					"TOPLEFT", -- [1]
					nil, -- [2]
					"TOPLEFT", -- [3]
					53.99979782104492, -- [4]
					-108.0000839233398, -- [5]
				},
			},
			["block"] = {
				["position"] = {
					"TOPRIGHT", -- [1]
					nil, -- [2]
					"TOPRIGHT", -- [3]
					-29.99996185302734, -- [4]
					-175.0000610351563, -- [5]
				},
			},
		},
	},
}
TomTomWaypoints = nil
TomTomWaypointsM = {
	["profileKeys"] = {
		["Ваззапер - Ревущий фьорд"] = "Ваззапер - Ревущий фьорд",
		["Мушкетерх - Ревущий фьорд"] = "Мушкетерх - Ревущий фьорд",
		["Ваззапер - Черный Шрам"] = "Ваззапер - Черный Шрам",
		["Плагмейстер - Черный Шрам"] = "Плагмейстер - Черный Шрам",
		["Кендифлоп - Ревущий фьорд"] = "Кендифлоп - Ревущий фьорд",
		["Калимистх - Ревущий фьорд"] = "Калимистх - Ревущий фьорд",
		["Мушкетер - Черный Шрам"] = "Мушкетер - Черный Шрам",
		["Кварик - Черный Шрам"] = "Кварик - Черный Шрам",
		["Итсафлейм - Черный Шрам"] = "Итсафлейм - Черный Шрам",
		["Комабекфаер - Черный Шрам"] = "Комабекфаер - Черный Шрам",
		["Жрумс - Черный Шрам"] = "Жрумс - Черный Шрам",
		["Фасрок - Черный Шрам"] = "Фасрок - Черный Шрам",
		["Флинтомист - Ревущий фьорд"] = "Флинтомист - Ревущий фьорд",
		["Соваестдетей - Ревущий фьорд"] = "Соваестдетей - Ревущий фьорд",
		["Клиндамист - Ревущий фьорд"] = "Клиндамист - Ревущий фьорд",
		["Итсафлеймх - Черный Шрам"] = "Итсафлеймх - Черный Шрам",
		["Хидрамист - Ревущий фьорд"] = "Хидрамист - Ревущий фьорд",
	},
	["profiles"] = {
		["Ваззапер - Ревущий фьорд"] = {
		},
		["Мушкетерх - Ревущий фьорд"] = {
		},
		["Ваззапер - Черный Шрам"] = {
		},
		["Плагмейстер - Черный Шрам"] = {
		},
		["Кендифлоп - Ревущий фьорд"] = {
		},
		["Калимистх - Ревущий фьорд"] = {
		},
		["Мушкетер - Черный Шрам"] = {
		},
		["Кварик - Черный Шрам"] = {
		},
		["Итсафлейм - Черный Шрам"] = {
		},
		["Комабекфаер - Черный Шрам"] = {
		},
		["Жрумс - Черный Шрам"] = {
		},
		["Фасрок - Черный Шрам"] = {
		},
		["Флинтомист - Ревущий фьорд"] = {
		},
		["Соваестдетей - Ревущий фьорд"] = {
		},
		["Клиндамист - Ревущий фьорд"] = {
		},
		["Итсафлеймх - Черный Шрам"] = {
		},
		["Хидрамист - Ревущий фьорд"] = {
		},
	},
}
